stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/*******************  Bit definition for FLASH_SECBB2R4 register  ******************/
#define FLASH_SECBB2R4_SEC0_Pos                   (0U)
#define FLASH_SECBB2R4_SEC0_Msk                   (0x1UL << FLASH_SECBB2R4_SEC0_Pos)            /*!< 0x00000001 */
#define FLASH_SECBB2R4_SEC0                       FLASH_SECBB2R4_SEC0_Msk                       /*!< Page 96 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC1_Pos                   (1U)
#define FLASH_SECBB2R4_SEC1_Msk                   (0x1UL << FLASH_SECBB2R4_SEC1_Pos)            /*!< 0x00000002 */
#define FLASH_SECBB2R4_SEC1                       FLASH_SECBB2R4_SEC1_Msk                       /*!< Page 97 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC2_Pos                   (2U)
#define FLASH_SECBB2R4_SEC2_Msk                   (0x1UL << FLASH_SECBB2R4_SEC2_Pos)            /*!< 0x00000004 */
#define FLASH_SECBB2R4_SEC2                       FLASH_SECBB2R4_SEC2_Msk                       /*!< Page 98 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC3_Pos                   (3U)
#define FLASH_SECBB2R4_SEC3_Msk                   (0x1UL << FLASH_SECBB2R4_SEC3_Pos)            /*!< 0x00000008 */
#define FLASH_SECBB2R4_SEC3                       FLASH_SECBB2R4_SEC3_Msk                       /*!< Page 99 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC4_Pos                   (4U)
#define FLASH_SECBB2R4_SEC4_Msk                   (0x1UL << FLASH_SECBB2R4_SEC4_Pos)            /*!< 0x00000010 */
#define FLASH_SECBB2R4_SEC4                       FLASH_SECBB2R4_SEC4_Msk                       /*!< Page 100 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC5_Pos                   (5U)
#define FLASH_SECBB2R4_SEC5_Msk                   (0x1UL << FLASH_SECBB2R4_SEC5_Pos)            /*!< 0x00000020 */
#define FLASH_SECBB2R4_SEC5                       FLASH_SECBB2R4_SEC5_Msk                       /*!< Page 101 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC6_Pos                   (6U)
#define FLASH_SECBB2R4_SEC6_Msk                   (0x1UL << FLASH_SECBB2R4_SEC6_Pos)            /*!< 0x00000040 */
#define FLASH_SECBB2R4_SEC6                       FLASH_SECBB2R4_SEC6_Msk                       /*!< Page 102 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC7_Pos                   (7U)
#define FLASH_SECBB2R4_SEC7_Msk                   (0x1UL << FLASH_SECBB2R4_SEC7_Pos)            /*!< 0x00000080 */
#define FLASH_SECBB2R4_SEC7                       FLASH_SECBB2R4_SEC7_Msk                       /*!< Page 103 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC8_Pos                   (8U)
#define FLASH_SECBB2R4_SEC8_Msk                   (0x1UL << FLASH_SECBB2R4_SEC8_Pos)            /*!< 0x00000100 */
#define FLASH_SECBB2R4_SEC8                       FLASH_SECBB2R4_SEC8_Msk                       /*!< Page 104 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC9_Pos                   (9U)
#define FLASH_SECBB2R4_SEC9_Msk                   (0x1UL << FLASH_SECBB2R4_SEC9_Pos)            /*!< 0x00000200 */
#define FLASH_SECBB2R4_SEC9                       FLASH_SECBB2R4_SEC9_Msk                       /*!< Page 105 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC10_Pos                  (10U)
#define FLASH_SECBB2R4_SEC10_Msk                  (0x1UL << FLASH_SECBB2R4_SEC10_Pos)           /*!< 0x00000400 */
#define FLASH_SECBB2R4_SEC10                      FLASH_SECBB2R4_SEC10_Msk                      /*!< Page 106 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC11_Pos                  (11U)
#define FLASH_SECBB2R4_SEC11_Msk                  (0x1UL << FLASH_SECBB2R4_SEC11_Pos)           /*!< 0x00000800 */
#define FLASH_SECBB2R4_SEC11                      FLASH_SECBB2R4_SEC11_Msk                      /*!< Page 107 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC12_Pos                  (12U)
#define FLASH_SECBB2R4_SEC12_Msk                  (0x1UL << FLASH_SECBB2R4_SEC12_Pos)           /*!< 0x00001000 */
#define FLASH_SECBB2R4_SEC12                      FLASH_SECBB2R4_SEC12_Msk                      /*!< Page 108 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC13_Pos                  (13U)
#define FLASH_SECBB2R4_SEC13_Msk                  (0x1UL << FLASH_SECBB2R4_SEC13_Pos)           /*!< 0x00002000 */
#define FLASH_SECBB2R4_SEC13                      FLASH_SECBB2R4_SEC13_Msk                      /*!< Page 109 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC14_Pos                  (14U)
#define FLASH_SECBB2R4_SEC14_Msk                  (0x1UL << FLASH_SECBB2R4_SEC14_Pos)           /*!< 0x00004000 */
#define FLASH_SECBB2R4_SEC14                      FLASH_SECBB2R4_SEC14_Msk                      /*!< Page 110 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC15_Pos                  (15U)
#define FLASH_SECBB2R4_SEC15_Msk                  (0x1UL << FLASH_SECBB2R4_SEC15_Pos)           /*!< 0x00008000 */
#define FLASH_SECBB2R4_SEC15                      FLASH_SECBB2R4_SEC15_Msk                      /*!< Page 111 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC16_Pos                  (16U)
#define FLASH_SECBB2R4_SEC16_Msk                  (0x1UL << FLASH_SECBB2R4_SEC16_Pos)           /*!< 0x00010000 */
#define FLASH_SECBB2R4_SEC16                      FLASH_SECBB2R4_SEC16_Msk                      /*!< Page 112 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC17_Pos                  (17U)
#define FLASH_SECBB2R4_SEC17_Msk                  (0x1UL << FLASH_SECBB2R4_SEC17_Pos)           /*!< 0x00020000 */
#define FLASH_SECBB2R4_SEC17                      FLASH_SECBB2R4_SEC17_Msk                      /*!< Page 113 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC18_Pos                  (18U)
#define FLASH_SECBB2R4_SEC18_Msk                  (0x1UL << FLASH_SECBB2R4_SEC18_Pos)           /*!< 0x00040000 */
#define FLASH_SECBB2R4_SEC18                      FLASH_SECBB2R4_SEC18_Msk                      /*!< Page 114 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC19_Pos                  (19U)
#define FLASH_SECBB2R4_SEC19_Msk                  (0x1UL << FLASH_SECBB2R4_SEC19_Pos)           /*!< 0x00080000 */
#define FLASH_SECBB2R4_SEC19                      FLASH_SECBB2R4_SEC19_Msk                      /*!< Page 115 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC20_Pos                  (20U)
#define FLASH_SECBB2R4_SEC20_Msk                  (0x1UL << FLASH_SECBB2R4_SEC20_Pos)           /*!< 0x00100000 */
#define FLASH_SECBB2R4_SEC20                      FLASH_SECBB2R4_SEC20_Msk                      /*!< Page 116 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC21_Pos                  (21U)
#define FLASH_SECBB2R4_SEC21_Msk                  (0x1UL << FLASH_SECBB2R4_SEC21_Pos)           /*!< 0x00200000 */
#define FLASH_SECBB2R4_SEC21                      FLASH_SECBB2R4_SEC21_Msk                      /*!< Page 117 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC22_Pos                  (22U)
#define FLASH_SECBB2R4_SEC22_Msk                  (0x1UL << FLASH_SECBB2R4_SEC22_Pos)           /*!< 0x00400000 */
#define FLASH_SECBB2R4_SEC22                      FLASH_SECBB2R4_SEC22_Msk                      /*!< Page 118 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC23_Pos                  (23U)
#define FLASH_SECBB2R4_SEC23_Msk                  (0x1UL << FLASH_SECBB2R4_SEC23_Pos)           /*!< 0x00800000 */
#define FLASH_SECBB2R4_SEC23                      FLASH_SECBB2R4_SEC23_Msk                      /*!< Page 119 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC24_Pos                  (24U)
#define FLASH_SECBB2R4_SEC24_Msk                  (0x1UL << FLASH_SECBB2R4_SEC24_Pos)           /*!< 0x01000000 */
#define FLASH_SECBB2R4_SEC24                      FLASH_SECBB2R4_SEC24_Msk                      /*!< Page 120 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC25_Pos                  (25U)
#define FLASH_SECBB2R4_SEC25_Msk                  (0x1UL << FLASH_SECBB2R4_SEC25_Pos)           /*!< 0x02000000 */
#define FLASH_SECBB2R4_SEC25                      FLASH_SECBB2R4_SEC25_Msk                      /*!< Page 121 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC26_Pos                  (26U)
#define FLASH_SECBB2R4_SEC26_Msk                  (0x1UL << FLASH_SECBB2R4_SEC26_Pos)           /*!< 0x04000000 */
#define FLASH_SECBB2R4_SEC26                      FLASH_SECBB2R4_SEC26_Msk                      /*!< Page 122 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC27_Pos                  (27U)
#define FLASH_SECBB2R4_SEC27_Msk                  (0x1UL << FLASH_SECBB2R4_SEC27_Pos)           /*!< 0x08000000 */
#define FLASH_SECBB2R4_SEC27                      FLASH_SECBB2R4_SEC27_Msk                      /*!< Page 123 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC28_Pos                  (28U)
#define FLASH_SECBB2R4_SEC28_Msk                  (0x1UL << FLASH_SECBB2R4_SEC28_Pos)           /*!< 0x10000000 */
#define FLASH_SECBB2R4_SEC28                      FLASH_SECBB2R4_SEC28_Msk                      /*!< Page 124 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC29_Pos                  (29U)
#define FLASH_SECBB2R4_SEC29_Msk                  (0x1UL << FLASH_SECBB2R4_SEC29_Pos)           /*!< 0x20000000 */
#define FLASH_SECBB2R4_SEC29                      FLASH_SECBB2R4_SEC29_Msk                      /*!< Page 125 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC30_Pos                  (30U)
#define FLASH_SECBB2R4_SEC30_Msk                  (0x1UL << FLASH_SECBB2R4_SEC30_Pos)           /*!< 0x40000000 */
#define FLASH_SECBB2R4_SEC30                      FLASH_SECBB2R4_SEC30_Msk                      /*!< Page 126 in bank 2 block-based secure */
#define FLASH_SECBB2R4_SEC31_Pos                  (31U)
#define FLASH_SECBB2R4_SEC31_Msk                  (0x1UL << FLASH_SECBB2R4_SEC31_Pos)           /*!< 0x80000000 */
#define FLASH_SECBB2R4_SEC31                      FLASH_SECBB2R4_SEC31_Msk                      /*!< Page 127 in bank 2 block-based secure */

