stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_DCMDPTR1 register  ********************/
/*!< PTCPU configuration */
#define HSP_DCMDPTR1_PTCPU_Pos (0U)
#define HSP_DCMDPTR1_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR1_PTCPU     HSP_DCMDPTR1_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */
#define HSP_DCMDPTR1_PTCPU_0   (0x00001UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000001 */
#define HSP_DCMDPTR1_PTCPU_1   (0x00002UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000002 */
#define HSP_DCMDPTR1_PTCPU_2   (0x00004UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000004 */
#define HSP_DCMDPTR1_PTCPU_3   (0x00008UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000008 */
#define HSP_DCMDPTR1_PTCPU_4   (0x00010UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000010 */
#define HSP_DCMDPTR1_PTCPU_5   (0x00020UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000020 */
#define HSP_DCMDPTR1_PTCPU_6   (0x00040UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000040 */
#define HSP_DCMDPTR1_PTCPU_7   (0x00080UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000080 */
#define HSP_DCMDPTR1_PTCPU_8   (0x00100UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000100 */
#define HSP_DCMDPTR1_PTCPU_9   (0x00200UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000200 */
#define HSP_DCMDPTR1_PTCPU_10  (0x00400UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000400 */
#define HSP_DCMDPTR1_PTCPU_11  (0x00800UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00000800 */
#define HSP_DCMDPTR1_PTCPU_12  (0x01000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00001000 */
#define HSP_DCMDPTR1_PTCPU_13  (0x02000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00002000 */
#define HSP_DCMDPTR1_PTCPU_14  (0x04000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00004000 */
#define HSP_DCMDPTR1_PTCPU_15  (0x08000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00008000 */
#define HSP_DCMDPTR1_PTCPU_16  (0x10000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00010000 */
#define HSP_DCMDPTR1_PTCPU_17  (0x20000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00020000 */
#define HSP_DCMDPTR1_PTCPU_18  (0x40000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00040000 */
#define HSP_DCMDPTR1_PTCPU_19  (0x80000UL << HSP_DCMDPTR1_PTCPU_Pos)    /*!< 0x00080000 */
#define HSP_DCMDPTR1_PTCPU_20  (0x100000UL << HSP_DCMDPTR1_PTCPU_Pos)   /*!< 0x00100000 */
#define HSP_DCMDPTR1_PTCPU_21  (0x200000UL << HSP_DCMDPTR1_PTCPU_Pos)   /*!< 0x00200000 */
#define HSP_DCMDPTR1_PTCPU_22  (0x400000UL << HSP_DCMDPTR1_PTCPU_Pos)   /*!< 0x00400000 */
#define HSP_DCMDPTR1_PTCPU_23  (0x800000UL << HSP_DCMDPTR1_PTCPU_Pos)   /*!< 0x00800000 */
#define HSP_DCMDPTR1_PTCPU_24  (0x1000000UL << HSP_DCMDPTR1_PTCPU_Pos)  /*!< 0x01000000 */
#define HSP_DCMDPTR1_PTCPU_25  (0x2000000UL << HSP_DCMDPTR1_PTCPU_Pos)  /*!< 0x02000000 */
#define HSP_DCMDPTR1_PTCPU_26  (0x4000000UL << HSP_DCMDPTR1_PTCPU_Pos)  /*!< 0x04000000 */
#define HSP_DCMDPTR1_PTCPU_27  (0x8000000UL << HSP_DCMDPTR1_PTCPU_Pos)  /*!< 0x08000000 */
#define HSP_DCMDPTR1_PTCPU_28  (0x10000000UL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0x10000000 */
#define HSP_DCMDPTR1_PTCPU_29  (0x20000000UL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0x20000000 */
#define HSP_DCMDPTR1_PTCPU_30  (0x40000000UL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0x40000000 */
#define HSP_DCMDPTR1_PTCPU_31  (0x80000000UL << HSP_DCMDPTR1_PTCPU_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_DCMDPTR2 register  ********************/
/*!< PTCPU configuration */
#define HSP_DCMDPTR2_PTCPU_Pos (0U)
#define HSP_DCMDPTR2_PTCPU_Msk (0xFFFFFFFFUL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0xFFFFFFFF */
#define HSP_DCMDPTR2_PTCPU     HSP_DCMDPTR2_PTCPU_Msk                   /*!< PTCPU[31:0] bits (Address pointer value) */
#define HSP_DCMDPTR2_PTCPU_0   (0x00001UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000001 */
#define HSP_DCMDPTR2_PTCPU_1   (0x00002UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000002 */
#define HSP_DCMDPTR2_PTCPU_2   (0x00004UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000004 */
#define HSP_DCMDPTR2_PTCPU_3   (0x00008UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000008 */
#define HSP_DCMDPTR2_PTCPU_4   (0x00010UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000010 */
#define HSP_DCMDPTR2_PTCPU_5   (0x00020UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000020 */
#define HSP_DCMDPTR2_PTCPU_6   (0x00040UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000040 */
#define HSP_DCMDPTR2_PTCPU_7   (0x00080UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000080 */
#define HSP_DCMDPTR2_PTCPU_8   (0x00100UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000100 */
#define HSP_DCMDPTR2_PTCPU_9   (0x00200UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000200 */
#define HSP_DCMDPTR2_PTCPU_10  (0x00400UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000400 */
#define HSP_DCMDPTR2_PTCPU_11  (0x00800UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00000800 */
#define HSP_DCMDPTR2_PTCPU_12  (0x01000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00001000 */
#define HSP_DCMDPTR2_PTCPU_13  (0x02000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00002000 */
#define HSP_DCMDPTR2_PTCPU_14  (0x04000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00004000 */
#define HSP_DCMDPTR2_PTCPU_15  (0x08000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00008000 */
#define HSP_DCMDPTR2_PTCPU_16  (0x10000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00010000 */
#define HSP_DCMDPTR2_PTCPU_17  (0x20000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00020000 */
#define HSP_DCMDPTR2_PTCPU_18  (0x40000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00040000 */
#define HSP_DCMDPTR2_PTCPU_19  (0x80000UL << HSP_DCMDPTR2_PTCPU_Pos)    /*!< 0x00080000 */
#define HSP_DCMDPTR2_PTCPU_20  (0x100000UL << HSP_DCMDPTR2_PTCPU_Pos)   /*!< 0x00100000 */
#define HSP_DCMDPTR2_PTCPU_21  (0x200000UL << HSP_DCMDPTR2_PTCPU_Pos)   /*!< 0x00200000 */
#define HSP_DCMDPTR2_PTCPU_22  (0x400000UL << HSP_DCMDPTR2_PTCPU_Pos)   /*!< 0x00400000 */
#define HSP_DCMDPTR2_PTCPU_23  (0x800000UL << HSP_DCMDPTR2_PTCPU_Pos)   /*!< 0x00800000 */
#define HSP_DCMDPTR2_PTCPU_24  (0x1000000UL << HSP_DCMDPTR2_PTCPU_Pos)  /*!< 0x01000000 */
#define HSP_DCMDPTR2_PTCPU_25  (0x2000000UL << HSP_DCMDPTR2_PTCPU_Pos)  /*!< 0x02000000 */
#define HSP_DCMDPTR2_PTCPU_26  (0x4000000UL << HSP_DCMDPTR2_PTCPU_Pos)  /*!< 0x04000000 */
#define HSP_DCMDPTR2_PTCPU_27  (0x8000000UL << HSP_DCMDPTR2_PTCPU_Pos)  /*!< 0x08000000 */
#define HSP_DCMDPTR2_PTCPU_28  (0x10000000UL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0x10000000 */
#define HSP_DCMDPTR2_PTCPU_29  (0x20000000UL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0x20000000 */
#define HSP_DCMDPTR2_PTCPU_30  (0x40000000UL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0x40000000 */
#define HSP_DCMDPTR2_PTCPU_31  (0x80000000UL << HSP_DCMDPTR2_PTCPU_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_EVTENR register  ********************/
/*!< EVTEN configuration */
#define HSP_EVTENR_EVTEN_Pos (1U)
#define HSP_EVTENR_EVTEN_Msk (0x3FFFFFUL << HSP_EVTENR_EVTEN_Pos) /*!< 0x007FFFFE */
#define HSP_EVTENR_EVTEN     HSP_EVTENR_EVTEN_Msk                 /*!< EVTEN[21:0] bits (Events enable) */
#define HSP_EVTENR_EVTEN_0   (0x0001UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000002 */
#define HSP_EVTENR_EVTEN_1   (0x0002UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000004 */
#define HSP_EVTENR_EVTEN_2   (0x0004UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000008 */
#define HSP_EVTENR_EVTEN_3   (0x0008UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000010 */
#define HSP_EVTENR_EVTEN_4   (0x0010UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000020 */
#define HSP_EVTENR_EVTEN_5   (0x0020UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000040 */
#define HSP_EVTENR_EVTEN_6   (0x0040UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000080 */
#define HSP_EVTENR_EVTEN_7   (0x0080UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000100 */
#define HSP_EVTENR_EVTEN_8   (0x0100UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000200 */
#define HSP_EVTENR_EVTEN_9   (0x0200UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000400 */
#define HSP_EVTENR_EVTEN_10  (0x0400UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00000800 */
#define HSP_EVTENR_EVTEN_11  (0x0800UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00001000 */
#define HSP_EVTENR_EVTEN_12  (0x1000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00002000 */
#define HSP_EVTENR_EVTEN_13  (0x2000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00004000 */
#define HSP_EVTENR_EVTEN_14  (0x4000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00008000 */
#define HSP_EVTENR_EVTEN_15  (0x8000UL << HSP_EVTENR_EVTEN_Pos)   /*!< 0x00010000 */
#define HSP_EVTENR_EVTEN_16  (0x10000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00020000 */
#define HSP_EVTENR_EVTEN_17  (0x20000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00040000 */
#define HSP_EVTENR_EVTEN_18  (0x40000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00080000 */
#define HSP_EVTENR_EVTEN_19  (0x80000UL << HSP_EVTENR_EVTEN_Pos)  /*!< 0x00100000 */
#define HSP_EVTENR_EVTEN_20  (0x100000UL << HSP_EVTENR_EVTEN_Pos) /*!< 0x00200000 */
#define HSP_EVTENR_EVTEN_21  (0x200000UL << HSP_EVTENR_EVTEN_Pos) /*!< 0x00400000 */

/********************  Bit definition for HSP_ESYNCENR register  ********************/
/*!< EVTSYNCEN configuration */
#define HSP_ESYNCENR_EVTSYNCEN_Pos  (1U)
#define HSP_ESYNCENR_EVTSYNCEN_Msk  (0x3FFFFFUL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x007FFFFE */
#define HSP_ESYNCENR_EVTSYNCEN      HSP_ESYNCENR_EVTSYNCEN_Msk                 /*!< EVTSYNCEN[21:0] bits (Event synchronization enable) */
#define HSP_ESYNCENR_EVTSYNCEN_0    (0x0001UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000002 */
#define HSP_ESYNCENR_EVTSYNCEN_1    (0x0002UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000004 */
#define HSP_ESYNCENR_EVTSYNCEN_2    (0x0004UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000008 */
#define HSP_ESYNCENR_EVTSYNCEN_3    (0x0008UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000010 */
#define HSP_ESYNCENR_EVTSYNCEN_4    (0x0010UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000020 */
#define HSP_ESYNCENR_EVTSYNCEN_5    (0x0020UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000040 */
#define HSP_ESYNCENR_EVTSYNCEN_6    (0x0040UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000080 */
#define HSP_ESYNCENR_EVTSYNCEN_7    (0x0080UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000100 */
#define HSP_ESYNCENR_EVTSYNCEN_8    (0x0100UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000200 */
#define HSP_ESYNCENR_EVTSYNCEN_9    (0x0200UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000400 */
#define HSP_ESYNCENR_EVTSYNCEN_10   (0x0400UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00000800 */
#define HSP_ESYNCENR_EVTSYNCEN_11   (0x0800UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00001000 */
#define HSP_ESYNCENR_EVTSYNCEN_12   (0x1000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00002000 */
#define HSP_ESYNCENR_EVTSYNCEN_13   (0x2000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00004000 */
#define HSP_ESYNCENR_EVTSYNCEN_14   (0x4000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00008000 */
#define HSP_ESYNCENR_EVTSYNCEN_15   (0x8000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)   /*!< 0x00010000 */
#define HSP_ESYNCENR_EVTSYNCEN_16   (0x10000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00020000 */
#define HSP_ESYNCENR_EVTSYNCEN_17   (0x20000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00040000 */
#define HSP_ESYNCENR_EVTSYNCEN_18   (0x40000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00080000 */
#define HSP_ESYNCENR_EVTSYNCEN_19   (0x80000UL << HSP_ESYNCENR_EVTSYNCEN_Pos)  /*!< 0x00100000 */
#define HSP_ESYNCENR_EVTSYNCEN_20   (0x100000UL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x00200000 */
#define HSP_ESYNCENR_EVTSYNCEN_21   (0x200000UL << HSP_ESYNCENR_EVTSYNCEN_Pos) /*!< 0x00400000 */
/*!< CDEGSYNCEN configuration */
#define HSP_ESYNCENR_CDEGSYNCEN_Pos (26U)
#define HSP_ESYNCENR_CDEGSYNCEN_Msk (0x1UL << HSP_ESYNCENR_CDEGSYNCEN_Pos)     /*!< 0x04000000 */
#define HSP_ESYNCENR_CDEGSYNCEN     HSP_ESYNCENR_CDEGSYNCEN_Msk                /*!< CDEGSYNCEN (CPU dedicated event synchronization enable) */

/********************  Bit definition for HSP_ESYNC0SRCR register  ********************/
/*!< EV1SSRC configuration */
#define HSP_ESYNC0SRCR_EV1SSRC_Pos (0U)
#define HSP_ESYNC0SRCR_EV1SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000003 */
#define HSP_ESYNC0SRCR_EV1SSRC     HSP_ESYNC0SRCR_EV1SSRC_Msk            /*!< EV1SSRC[1:0] bits (Event 1 synchronization source) */
#define HSP_ESYNC0SRCR_EV1SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000001 */
#define HSP_ESYNC0SRCR_EV1SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV1SSRC_Pos) /*!< 0x00000002 */
/*!< EV2SSRC configuration */
#define HSP_ESYNC0SRCR_EV2SSRC_Pos (4U)
#define HSP_ESYNC0SRCR_EV2SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC0SRCR_EV2SSRC     HSP_ESYNC0SRCR_EV2SSRC_Msk            /*!< EV2SSRC[1:0] bits (Event 2 synchronization source) */
#define HSP_ESYNC0SRCR_EV2SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC0SRCR_EV2SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV2SSRC_Pos) /*!< 0x00000020 */
/*!< EV3SSRC configuration */
#define HSP_ESYNC0SRCR_EV3SSRC_Pos (8U)
#define HSP_ESYNC0SRCR_EV3SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC0SRCR_EV3SSRC     HSP_ESYNC0SRCR_EV3SSRC_Msk            /*!< EV3SSRC[1:0] bits (Event 3 synchronization source) */
#define HSP_ESYNC0SRCR_EV3SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC0SRCR_EV3SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV3SSRC_Pos) /*!< 0x00000200 */
/*!< EV4SSRC configuration */
#define HSP_ESYNC0SRCR_EV4SSRC_Pos (12U)
#define HSP_ESYNC0SRCR_EV4SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC0SRCR_EV4SSRC     HSP_ESYNC0SRCR_EV4SSRC_Msk            /*!< EV4SSRC[1:0] bits (Event 4 synchronization source) */
#define HSP_ESYNC0SRCR_EV4SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC0SRCR_EV4SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV4SSRC_Pos) /*!< 0x00002000 */
/*!< EV5SSRC configuration */
#define HSP_ESYNC0SRCR_EV5SSRC_Pos (16U)
#define HSP_ESYNC0SRCR_EV5SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC0SRCR_EV5SSRC     HSP_ESYNC0SRCR_EV5SSRC_Msk            /*!< EV5SSRC[1:0] bits (Event 5 synchronization source) */
#define HSP_ESYNC0SRCR_EV5SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC0SRCR_EV5SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV5SSRC_Pos) /*!< 0x00020000 */
/*!< EV6SSRC configuration */
#define HSP_ESYNC0SRCR_EV6SSRC_Pos (20U)
#define HSP_ESYNC0SRCR_EV6SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC0SRCR_EV6SSRC     HSP_ESYNC0SRCR_EV6SSRC_Msk            /*!< EV6SSRC[1:0] bits (Event 6 synchronization source) */
#define HSP_ESYNC0SRCR_EV6SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC0SRCR_EV6SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV6SSRC_Pos) /*!< 0x00200000 */
/*!< EV7SSRC configuration */
#define HSP_ESYNC0SRCR_EV7SSRC_Pos (24U)
#define HSP_ESYNC0SRCR_EV7SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x03000000 */
#define HSP_ESYNC0SRCR_EV7SSRC     HSP_ESYNC0SRCR_EV7SSRC_Msk            /*!< EV7SSRC[1:0] bits (Event 7 synchronization source) */
#define HSP_ESYNC0SRCR_EV7SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x01000000 */
#define HSP_ESYNC0SRCR_EV7SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV7SSRC_Pos) /*!< 0x02000000 */
/*!< EV8SSRC configuration */
#define HSP_ESYNC0SRCR_EV8SSRC_Pos (28U)
#define HSP_ESYNC0SRCR_EV8SSRC_Msk (0x3UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x30000000 */
#define HSP_ESYNC0SRCR_EV8SSRC     HSP_ESYNC0SRCR_EV8SSRC_Msk            /*!< EV8SSRC[1:0] bits (Event 8 synchronization source) */
#define HSP_ESYNC0SRCR_EV8SSRC_0   (0x1UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x10000000 */
#define HSP_ESYNC0SRCR_EV8SSRC_1   (0x2UL << HSP_ESYNC0SRCR_EV8SSRC_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_ESYNC1SRCR register  ********************/
/*!< EV9SSRC configuration */
#define HSP_ESYNC1SRCR_EV9SSRC_Pos  (0U)
#define HSP_ESYNC1SRCR_EV9SSRC_Msk  (0x3UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000003 */
#define HSP_ESYNC1SRCR_EV9SSRC      HSP_ESYNC1SRCR_EV9SSRC_Msk             /*!< EV9SSRC[1:0] bits (Event 9 synchronization source) */
#define HSP_ESYNC1SRCR_EV9SSRC_0    (0x1UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000001 */
#define HSP_ESYNC1SRCR_EV9SSRC_1    (0x2UL << HSP_ESYNC1SRCR_EV9SSRC_Pos)  /*!< 0x00000002 */
/*!< EV10SSRC configuration */
#define HSP_ESYNC1SRCR_EV10SSRC_Pos (4U)
#define HSP_ESYNC1SRCR_EV10SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC1SRCR_EV10SSRC     HSP_ESYNC1SRCR_EV10SSRC_Msk            /*!< EV10SSRC[1:0] bits (Event 10 synchronization source) */
#define HSP_ESYNC1SRCR_EV10SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC1SRCR_EV10SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV10SSRC_Pos) /*!< 0x00000020 */
/*!< EV11SSRC configuration */
#define HSP_ESYNC1SRCR_EV11SSRC_Pos (8U)
#define HSP_ESYNC1SRCR_EV11SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC1SRCR_EV11SSRC     HSP_ESYNC1SRCR_EV11SSRC_Msk            /*!< EV11SSRC[1:0] bits (Event 11 synchronization source) */
#define HSP_ESYNC1SRCR_EV11SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC1SRCR_EV11SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV11SSRC_Pos) /*!< 0x00000200 */
/*!< EV12SSRC configuration */
#define HSP_ESYNC1SRCR_EV12SSRC_Pos (12U)
#define HSP_ESYNC1SRCR_EV12SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC1SRCR_EV12SSRC     HSP_ESYNC1SRCR_EV12SSRC_Msk            /*!< EV12SSRC[1:0] bits (Event 12 synchronization source) */
#define HSP_ESYNC1SRCR_EV12SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC1SRCR_EV12SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV12SSRC_Pos) /*!< 0x00002000 */
/*!< EV13SSRC configuration */
#define HSP_ESYNC1SRCR_EV13SSRC_Pos (16U)
#define HSP_ESYNC1SRCR_EV13SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC1SRCR_EV13SSRC     HSP_ESYNC1SRCR_EV13SSRC_Msk            /*!< EV13SSRC[1:0] bits (Event 13 synchronization source) */
#define HSP_ESYNC1SRCR_EV13SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC1SRCR_EV13SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV13SSRC_Pos) /*!< 0x00020000 */
/*!< EV14SSRC configuration */
#define HSP_ESYNC1SRCR_EV14SSRC_Pos (20U)
#define HSP_ESYNC1SRCR_EV14SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC1SRCR_EV14SSRC     HSP_ESYNC1SRCR_EV14SSRC_Msk            /*!< EV14SSRC[1:0] bits (Event 14 synchronization source) */
#define HSP_ESYNC1SRCR_EV14SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC1SRCR_EV14SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV14SSRC_Pos) /*!< 0x00200000 */
/*!< EV15SSRC configuration */
#define HSP_ESYNC1SRCR_EV15SSRC_Pos (24U)
#define HSP_ESYNC1SRCR_EV15SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x03000000 */
#define HSP_ESYNC1SRCR_EV15SSRC     HSP_ESYNC1SRCR_EV15SSRC_Msk            /*!< EV15SSRC[1:0] bits (Event 15 synchronization source) */
#define HSP_ESYNC1SRCR_EV15SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x01000000 */
#define HSP_ESYNC1SRCR_EV15SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV15SSRC_Pos) /*!< 0x02000000 */
/*!< EV16SSRC configuration */
#define HSP_ESYNC1SRCR_EV16SSRC_Pos (28U)
#define HSP_ESYNC1SRCR_EV16SSRC_Msk (0x3UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x30000000 */
#define HSP_ESYNC1SRCR_EV16SSRC     HSP_ESYNC1SRCR_EV16SSRC_Msk            /*!< EV16SSRC[1:0] bits (Event 16 synchronization source) */
#define HSP_ESYNC1SRCR_EV16SSRC_0   (0x1UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x10000000 */
#define HSP_ESYNC1SRCR_EV16SSRC_1   (0x2UL << HSP_ESYNC1SRCR_EV16SSRC_Pos) /*!< 0x20000000 */

/********************  Bit definition for HSP_ESYNC2SRCR register  ********************/
/*!< EV17SSRC configuration */
#define HSP_ESYNC2SRCR_EV17SSRC_Pos (0U)
#define HSP_ESYNC2SRCR_EV17SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000003 */
#define HSP_ESYNC2SRCR_EV17SSRC     HSP_ESYNC2SRCR_EV17SSRC_Msk            /*!< EV17SSRC[1:0] bits (Event 17 synchronization source) */
#define HSP_ESYNC2SRCR_EV17SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000001 */
#define HSP_ESYNC2SRCR_EV17SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV17SSRC_Pos) /*!< 0x00000002 */
/*!< EV18SSRC configuration */
#define HSP_ESYNC2SRCR_EV18SSRC_Pos (4U)
#define HSP_ESYNC2SRCR_EV18SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000030 */
#define HSP_ESYNC2SRCR_EV18SSRC     HSP_ESYNC2SRCR_EV18SSRC_Msk            /*!< EV18SSRC[1:0] bits (Event 18 synchronization source) */
#define HSP_ESYNC2SRCR_EV18SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000010 */
#define HSP_ESYNC2SRCR_EV18SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV18SSRC_Pos) /*!< 0x00000020 */
/*!< EV19SSRC configuration */
#define HSP_ESYNC2SRCR_EV19SSRC_Pos (8U)
#define HSP_ESYNC2SRCR_EV19SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000300 */
#define HSP_ESYNC2SRCR_EV19SSRC     HSP_ESYNC2SRCR_EV19SSRC_Msk            /*!< EV19SSRC[1:0] bits (Event 19 synchronization source) */
#define HSP_ESYNC2SRCR_EV19SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000100 */
#define HSP_ESYNC2SRCR_EV19SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV19SSRC_Pos) /*!< 0x00000200 */
/*!< EV20SSRC configuration */
#define HSP_ESYNC2SRCR_EV20SSRC_Pos (12U)
#define HSP_ESYNC2SRCR_EV20SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00003000 */
#define HSP_ESYNC2SRCR_EV20SSRC     HSP_ESYNC2SRCR_EV20SSRC_Msk            /*!< EV20SSRC[1:0] bits (Event 20 synchronization source) */
#define HSP_ESYNC2SRCR_EV20SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00001000 */
#define HSP_ESYNC2SRCR_EV20SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV20SSRC_Pos) /*!< 0x00002000 */
/*!< EV21SSRC configuration */
#define HSP_ESYNC2SRCR_EV21SSRC_Pos (16U)
#define HSP_ESYNC2SRCR_EV21SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00030000 */
#define HSP_ESYNC2SRCR_EV21SSRC     HSP_ESYNC2SRCR_EV21SSRC_Msk            /*!< EV21SSRC[1:0] bits (Event 21 synchronization source) */
#define HSP_ESYNC2SRCR_EV21SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00010000 */
#define HSP_ESYNC2SRCR_EV21SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV21SSRC_Pos) /*!< 0x00020000 */
/*!< EV22SSRC configuration */
#define HSP_ESYNC2SRCR_EV22SSRC_Pos (20U)
#define HSP_ESYNC2SRCR_EV22SSRC_Msk (0x3UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00300000 */
#define HSP_ESYNC2SRCR_EV22SSRC     HSP_ESYNC2SRCR_EV22SSRC_Msk            /*!< EV22SSRC[1:0] bits (Event 22 synchronization source) */
#define HSP_ESYNC2SRCR_EV22SSRC_0   (0x1UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00100000 */
#define HSP_ESYNC2SRCR_EV22SSRC_1   (0x2UL << HSP_ESYNC2SRCR_EV22SSRC_Pos) /*!< 0x00200000 */
/*!< CDEGSSRC configuration */
#define HSP_ESYNC2SRCR_CDEGSSRC_Pos (30U)
#define HSP_ESYNC2SRCR_CDEGSSRC_Msk (0x3UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0xC0000000 */
#define HSP_ESYNC2SRCR_CDEGSSRC     HSP_ESYNC2SRCR_CDEGSSRC_Msk            /*!< CDEGSSRC[1:0] bits (CPU dedicated event synchronization source) */
#define HSP_ESYNC2SRCR_CDEGSSRC_0   (0x1UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0x40000000 */
#define HSP_ESYNC2SRCR_CDEGSSRC_1   (0x2UL << HSP_ESYNC2SRCR_CDEGSSRC_Pos) /*!< 0x80000000 */

