stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_PEVTLR register  ********************/
/*!< EVTL configuration */
#define HSP_PEVTLR_EVTL_Pos (0U)
#define HSP_PEVTLR_EVTL_Msk (0xFFFFFFFUL << HSP_PEVTLR_EVTL_Pos) /*!< 0x0FFFFFFF */
#define HSP_PEVTLR_EVTL     HSP_PEVTLR_EVTL_Msk                  /*!< EVTL[27:0] bits (Event level) */
#define HSP_PEVTLR_EVTL_0   (0x0001UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000001 */
#define HSP_PEVTLR_EVTL_1   (0x0002UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000002 */
#define HSP_PEVTLR_EVTL_2   (0x0004UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000004 */
#define HSP_PEVTLR_EVTL_3   (0x0008UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000008 */
#define HSP_PEVTLR_EVTL_4   (0x0010UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000010 */
#define HSP_PEVTLR_EVTL_5   (0x0020UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000020 */
#define HSP_PEVTLR_EVTL_6   (0x0040UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000040 */
#define HSP_PEVTLR_EVTL_7   (0x0080UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000080 */
#define HSP_PEVTLR_EVTL_8   (0x0100UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000100 */
#define HSP_PEVTLR_EVTL_9   (0x0200UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000200 */
#define HSP_PEVTLR_EVTL_10  (0x0400UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000400 */
#define HSP_PEVTLR_EVTL_11  (0x0800UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00000800 */
#define HSP_PEVTLR_EVTL_12  (0x1000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00001000 */
#define HSP_PEVTLR_EVTL_13  (0x2000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00002000 */
#define HSP_PEVTLR_EVTL_14  (0x4000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00004000 */
#define HSP_PEVTLR_EVTL_15  (0x8000UL << HSP_PEVTLR_EVTL_Pos)    /*!< 0x00008000 */
#define HSP_PEVTLR_EVTL_16  (0x10000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00010000 */
#define HSP_PEVTLR_EVTL_17  (0x20000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00020000 */
#define HSP_PEVTLR_EVTL_18  (0x40000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00040000 */
#define HSP_PEVTLR_EVTL_19  (0x80000UL << HSP_PEVTLR_EVTL_Pos)   /*!< 0x00080000 */
#define HSP_PEVTLR_EVTL_20  (0x100000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00100000 */
#define HSP_PEVTLR_EVTL_21  (0x200000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00200000 */
#define HSP_PEVTLR_EVTL_22  (0x400000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00400000 */
#define HSP_PEVTLR_EVTL_23  (0x800000UL << HSP_PEVTLR_EVTL_Pos)  /*!< 0x00800000 */
#define HSP_PEVTLR_EVTL_24  (0x1000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x01000000 */
#define HSP_PEVTLR_EVTL_25  (0x2000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x02000000 */
#define HSP_PEVTLR_EVTL_26  (0x4000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x04000000 */
#define HSP_PEVTLR_EVTL_27  (0x8000000UL << HSP_PEVTLR_EVTL_Pos) /*!< 0x08000000 */

/********************  Bit definition for HSP_ITFENR register  ********************/
/*!< STREAMEN configuration */
#define HSP_ITFENR_STREAMEN_Pos (8U)
#define HSP_ITFENR_STREAMEN_Msk (0x1UL << HSP_ITFENR_STREAMEN_Pos) /*!< 0x00000100 */
#define HSP_ITFENR_STREAMEN     HSP_ITFENR_STREAMEN_Msk            /*!< STREAMEN (STREAMITF enable <sup>(1)</sup>) */
/*!< TRGOEN configuration */
#define HSP_ITFENR_TRGOEN_Pos   (12U)
#define HSP_ITFENR_TRGOEN_Msk   (0x1UL << HSP_ITFENR_TRGOEN_Pos)   /*!< 0x00001000 */
#define HSP_ITFENR_TRGOEN       HSP_ITFENR_TRGOEN_Msk              /*!< TRGOEN (TRGO enable bit <sup>(1)</sup>) */
/*!< TRGI0EN configuration */
#define HSP_ITFENR_TRGI0EN_Pos  (16U)
#define HSP_ITFENR_TRGI0EN_Msk  (0x1UL << HSP_ITFENR_TRGI0EN_Pos)  /*!< 0x00010000 */
#define HSP_ITFENR_TRGI0EN      HSP_ITFENR_TRGI0EN_Msk             /*!< TRGI0EN (TRGIN0 enable bit <sup>(1)</sup>) */
/*!< TRGI1EN configuration */
#define HSP_ITFENR_TRGI1EN_Pos  (17U)
#define HSP_ITFENR_TRGI1EN_Msk  (0x1UL << HSP_ITFENR_TRGI1EN_Pos)  /*!< 0x00020000 */
#define HSP_ITFENR_TRGI1EN      HSP_ITFENR_TRGI1EN_Msk             /*!< TRGI1EN (TRGIN1 enable bit <sup>(1)</sup>) */
/*!< TRGI2EN configuration */
#define HSP_ITFENR_TRGI2EN_Pos  (18U)
#define HSP_ITFENR_TRGI2EN_Msk  (0x1UL << HSP_ITFENR_TRGI2EN_Pos)  /*!< 0x00040000 */
#define HSP_ITFENR_TRGI2EN      HSP_ITFENR_TRGI2EN_Msk             /*!< TRGI2EN (TRGIN2 enable bit <sup>(1)</sup>) */
/*!< TRGI3EN configuration */
#define HSP_ITFENR_TRGI3EN_Pos  (19U)
#define HSP_ITFENR_TRGI3EN_Msk  (0x1UL << HSP_ITFENR_TRGI3EN_Pos)  /*!< 0x00080000 */
#define HSP_ITFENR_TRGI3EN      HSP_ITFENR_TRGI3EN_Msk             /*!< TRGI3EN (TRGIN3 enable bit <sup>(1)</sup>) */
/*!< TRGI4EN configuration */
#define HSP_ITFENR_TRGI4EN_Pos  (20U)
#define HSP_ITFENR_TRGI4EN_Msk  (0x1UL << HSP_ITFENR_TRGI4EN_Pos)  /*!< 0x00100000 */
#define HSP_ITFENR_TRGI4EN      HSP_ITFENR_TRGI4EN_Msk             /*!< TRGI4EN (TRGIN4 enable bit <sup>(1)</sup>) */
/*!< TRGI5EN configuration */
#define HSP_ITFENR_TRGI5EN_Pos  (21U)
#define HSP_ITFENR_TRGI5EN_Msk  (0x1UL << HSP_ITFENR_TRGI5EN_Pos)  /*!< 0x00200000 */
#define HSP_ITFENR_TRGI5EN      HSP_ITFENR_TRGI5EN_Msk             /*!< TRGI5EN (TRGIN5 enable bit <sup>(1)</sup>) */
/*!< TRGI6EN configuration */
#define HSP_ITFENR_TRGI6EN_Pos  (22U)
#define HSP_ITFENR_TRGI6EN_Msk  (0x1UL << HSP_ITFENR_TRGI6EN_Pos)  /*!< 0x00400000 */
#define HSP_ITFENR_TRGI6EN      HSP_ITFENR_TRGI6EN_Msk             /*!< TRGI6EN (TRGIN6 enable bit <sup>(1)</sup>) */
/*!< TRGI7EN configuration */
#define HSP_ITFENR_TRGI7EN_Pos  (23U)
#define HSP_ITFENR_TRGI7EN_Msk  (0x1UL << HSP_ITFENR_TRGI7EN_Pos)  /*!< 0x00800000 */
#define HSP_ITFENR_TRGI7EN      HSP_ITFENR_TRGI7EN_Msk             /*!< TRGI7EN (TRGIN7 enable bit <sup>(1)</sup>) */
/*!< TRGI8EN configuration */
#define HSP_ITFENR_TRGI8EN_Pos  (24U)
#define HSP_ITFENR_TRGI8EN_Msk  (0x1UL << HSP_ITFENR_TRGI8EN_Pos)  /*!< 0x01000000 */
#define HSP_ITFENR_TRGI8EN      HSP_ITFENR_TRGI8EN_Msk             /*!< TRGI8EN (TRGIN8 enable bit <sup>(1)</sup>) */
/*!< TRGI9EN configuration */
#define HSP_ITFENR_TRGI9EN_Pos  (25U)
#define HSP_ITFENR_TRGI9EN_Msk  (0x1UL << HSP_ITFENR_TRGI9EN_Pos)  /*!< 0x02000000 */
#define HSP_ITFENR_TRGI9EN      HSP_ITFENR_TRGI9EN_Msk             /*!< TRGI9EN (TRGIN9 enable bit <sup>(1)</sup>) */
/*!< DCMDDIS configuration */
#define HSP_ITFENR_DCMDDIS_Pos  (27U)
#define HSP_ITFENR_DCMDDIS_Msk  (0x1UL << HSP_ITFENR_DCMDDIS_Pos)  /*!< 0x08000000 */
#define HSP_ITFENR_DCMDDIS      HSP_ITFENR_DCMDDIS_Msk             /*!< DCMDDIS (Direct command interface disable bit ) */
/*!< CSEGEN configuration */
#define HSP_ITFENR_CSEGEN_Pos   (28U)
#define HSP_ITFENR_CSEGEN_Msk   (0x1UL << HSP_ITFENR_CSEGEN_Pos)   /*!< 0x10000000 */
#define HSP_ITFENR_CSEGEN       HSP_ITFENR_CSEGEN_Msk              /*!< CSEGEN (CSEG interface enable bit <sup>(1)</sup>) */
/*!< CDEGEN configuration */
#define HSP_ITFENR_CDEGEN_Pos   (29U)
#define HSP_ITFENR_CDEGEN_Msk   (0x1UL << HSP_ITFENR_CDEGEN_Pos)   /*!< 0x20000000 */
#define HSP_ITFENR_CDEGEN       HSP_ITFENR_CDEGEN_Msk              /*!< CDEGEN (CDEG interface enable bit ) */
/*!< HSEGEN configuration */
#define HSP_ITFENR_HSEGEN_Pos   (30U)
#define HSP_ITFENR_HSEGEN_Msk   (0x1UL << HSP_ITFENR_HSEGEN_Pos)   /*!< 0x40000000 */
#define HSP_ITFENR_HSEGEN       HSP_ITFENR_HSEGEN_Msk              /*!< HSEGEN (HSEG interface enable bit ) */
/*!< HDEGEN configuration */
#define HSP_ITFENR_HDEGEN_Pos   (31U)
#define HSP_ITFENR_HDEGEN_Msk   (0x1UL << HSP_ITFENR_HDEGEN_Pos)   /*!< 0x80000000 */
#define HSP_ITFENR_HDEGEN       HSP_ITFENR_HDEGEN_Msk              /*!< HDEGEN (HDEG interface enable bit ) */

/********************  Bit definition for HSP_EVTSRC0R register  ********************/
/*!< EVT1SRC configuration */
#define HSP_EVTSRC0R_EVT1SRC_Pos (0U)
#define HSP_EVTSRC0R_EVT1SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000007 */
#define HSP_EVTSRC0R_EVT1SRC     HSP_EVTSRC0R_EVT1SRC_Msk            /*!< EVT1SRC[2:0] bits (Event source selection for priority encoder input 1) */
#define HSP_EVTSRC0R_EVT1SRC_0   (0x1UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000001 */
#define HSP_EVTSRC0R_EVT1SRC_1   (0x2UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000002 */
#define HSP_EVTSRC0R_EVT1SRC_2   (0x4UL << HSP_EVTSRC0R_EVT1SRC_Pos) /*!< 0x00000004 */
/*!< EVT2SRC configuration */
#define HSP_EVTSRC0R_EVT2SRC_Pos (4U)
#define HSP_EVTSRC0R_EVT2SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC0R_EVT2SRC     HSP_EVTSRC0R_EVT2SRC_Msk            /*!< EVT2SRC[2:0] bits (Event source selection for priority encoder input 2) */
#define HSP_EVTSRC0R_EVT2SRC_0   (0x1UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC0R_EVT2SRC_1   (0x2UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC0R_EVT2SRC_2   (0x4UL << HSP_EVTSRC0R_EVT2SRC_Pos) /*!< 0x00000040 */
/*!< EVT3SRC configuration */
#define HSP_EVTSRC0R_EVT3SRC_Pos (8U)
#define HSP_EVTSRC0R_EVT3SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC0R_EVT3SRC     HSP_EVTSRC0R_EVT3SRC_Msk            /*!< EVT3SRC[2:0] bits (Event source selection for priority encoder input 3) */
#define HSP_EVTSRC0R_EVT3SRC_0   (0x1UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC0R_EVT3SRC_1   (0x2UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC0R_EVT3SRC_2   (0x4UL << HSP_EVTSRC0R_EVT3SRC_Pos) /*!< 0x00000400 */
/*!< EVT4SRC configuration */
#define HSP_EVTSRC0R_EVT4SRC_Pos (12U)
#define HSP_EVTSRC0R_EVT4SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC0R_EVT4SRC     HSP_EVTSRC0R_EVT4SRC_Msk            /*!< EVT4SRC[2:0] bits (Event source selection for priority encoder input 4) */
#define HSP_EVTSRC0R_EVT4SRC_0   (0x1UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC0R_EVT4SRC_1   (0x2UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC0R_EVT4SRC_2   (0x4UL << HSP_EVTSRC0R_EVT4SRC_Pos) /*!< 0x00004000 */
/*!< EVT5SRC configuration */
#define HSP_EVTSRC0R_EVT5SRC_Pos (16U)
#define HSP_EVTSRC0R_EVT5SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC0R_EVT5SRC     HSP_EVTSRC0R_EVT5SRC_Msk            /*!< EVT5SRC[2:0] bits (Event source selection for priority encoder input 5) */
#define HSP_EVTSRC0R_EVT5SRC_0   (0x1UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC0R_EVT5SRC_1   (0x2UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC0R_EVT5SRC_2   (0x4UL << HSP_EVTSRC0R_EVT5SRC_Pos) /*!< 0x00040000 */
/*!< EVT6SRC configuration */
#define HSP_EVTSRC0R_EVT6SRC_Pos (20U)
#define HSP_EVTSRC0R_EVT6SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC0R_EVT6SRC     HSP_EVTSRC0R_EVT6SRC_Msk            /*!< EVT6SRC[2:0] bits (Event source selection for priority encoder input 6) */
#define HSP_EVTSRC0R_EVT6SRC_0   (0x1UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC0R_EVT6SRC_1   (0x2UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC0R_EVT6SRC_2   (0x4UL << HSP_EVTSRC0R_EVT6SRC_Pos) /*!< 0x00400000 */
/*!< EVT7SRC configuration */
#define HSP_EVTSRC0R_EVT7SRC_Pos (24U)
#define HSP_EVTSRC0R_EVT7SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x07000000 */
#define HSP_EVTSRC0R_EVT7SRC     HSP_EVTSRC0R_EVT7SRC_Msk            /*!< EVT7SRC[2:0] bits (Event source selection for priority encoder input 7) */
#define HSP_EVTSRC0R_EVT7SRC_0   (0x1UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x01000000 */
#define HSP_EVTSRC0R_EVT7SRC_1   (0x2UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x02000000 */
#define HSP_EVTSRC0R_EVT7SRC_2   (0x4UL << HSP_EVTSRC0R_EVT7SRC_Pos) /*!< 0x04000000 */
/*!< EVT8SRC configuration */
#define HSP_EVTSRC0R_EVT8SRC_Pos (28U)
#define HSP_EVTSRC0R_EVT8SRC_Msk (0x7UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x70000000 */
#define HSP_EVTSRC0R_EVT8SRC     HSP_EVTSRC0R_EVT8SRC_Msk            /*!< EVT8SRC[2:0] bits (Event source selection for priority encoder input 8) */
#define HSP_EVTSRC0R_EVT8SRC_0   (0x1UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x10000000 */
#define HSP_EVTSRC0R_EVT8SRC_1   (0x2UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x20000000 */
#define HSP_EVTSRC0R_EVT8SRC_2   (0x4UL << HSP_EVTSRC0R_EVT8SRC_Pos) /*!< 0x40000000 */

/********************  Bit definition for HSP_EVTSRC1R register  ********************/
/*!< EVT9SRC configuration */
#define HSP_EVTSRC1R_EVT9SRC_Pos  (0U)
#define HSP_EVTSRC1R_EVT9SRC_Msk  (0x7UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000007 */
#define HSP_EVTSRC1R_EVT9SRC      HSP_EVTSRC1R_EVT9SRC_Msk             /*!< EVT9SRC[2:0] bits (Event source selection for priority encoder input 9) */
#define HSP_EVTSRC1R_EVT9SRC_0    (0x1UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000001 */
#define HSP_EVTSRC1R_EVT9SRC_1    (0x2UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000002 */
#define HSP_EVTSRC1R_EVT9SRC_2    (0x4UL << HSP_EVTSRC1R_EVT9SRC_Pos)  /*!< 0x00000004 */
/*!< EVT10SRC configuration */
#define HSP_EVTSRC1R_EVT10SRC_Pos (4U)
#define HSP_EVTSRC1R_EVT10SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC1R_EVT10SRC     HSP_EVTSRC1R_EVT10SRC_Msk            /*!< EVT10SRC[2:0] bits (Event source selection for priority encoder input 10) */
#define HSP_EVTSRC1R_EVT10SRC_0   (0x1UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC1R_EVT10SRC_1   (0x2UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC1R_EVT10SRC_2   (0x4UL << HSP_EVTSRC1R_EVT10SRC_Pos) /*!< 0x00000040 */
/*!< EVT11SRC configuration */
#define HSP_EVTSRC1R_EVT11SRC_Pos (8U)
#define HSP_EVTSRC1R_EVT11SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC1R_EVT11SRC     HSP_EVTSRC1R_EVT11SRC_Msk            /*!< EVT11SRC[2:0] bits (Event source selection for priority encoder input 11) */
#define HSP_EVTSRC1R_EVT11SRC_0   (0x1UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC1R_EVT11SRC_1   (0x2UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC1R_EVT11SRC_2   (0x4UL << HSP_EVTSRC1R_EVT11SRC_Pos) /*!< 0x00000400 */
/*!< EVT12SRC configuration */
#define HSP_EVTSRC1R_EVT12SRC_Pos (12U)
#define HSP_EVTSRC1R_EVT12SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC1R_EVT12SRC     HSP_EVTSRC1R_EVT12SRC_Msk            /*!< EVT12SRC[2:0] bits (Event source selection for priority encoder input 12) */
#define HSP_EVTSRC1R_EVT12SRC_0   (0x1UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC1R_EVT12SRC_1   (0x2UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC1R_EVT12SRC_2   (0x4UL << HSP_EVTSRC1R_EVT12SRC_Pos) /*!< 0x00004000 */
/*!< EVT13SRC configuration */
#define HSP_EVTSRC1R_EVT13SRC_Pos (16U)
#define HSP_EVTSRC1R_EVT13SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC1R_EVT13SRC     HSP_EVTSRC1R_EVT13SRC_Msk            /*!< EVT13SRC[2:0] bits (Event source selection for priority encoder input 13) */
#define HSP_EVTSRC1R_EVT13SRC_0   (0x1UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC1R_EVT13SRC_1   (0x2UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC1R_EVT13SRC_2   (0x4UL << HSP_EVTSRC1R_EVT13SRC_Pos) /*!< 0x00040000 */
/*!< EVT14SRC configuration */
#define HSP_EVTSRC1R_EVT14SRC_Pos (20U)
#define HSP_EVTSRC1R_EVT14SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC1R_EVT14SRC     HSP_EVTSRC1R_EVT14SRC_Msk            /*!< EVT14SRC[2:0] bits (Event source selection for priority encoder input 14) */
#define HSP_EVTSRC1R_EVT14SRC_0   (0x1UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC1R_EVT14SRC_1   (0x2UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC1R_EVT14SRC_2   (0x4UL << HSP_EVTSRC1R_EVT14SRC_Pos) /*!< 0x00400000 */
/*!< EVT15SRC configuration */
#define HSP_EVTSRC1R_EVT15SRC_Pos (24U)
#define HSP_EVTSRC1R_EVT15SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x07000000 */
#define HSP_EVTSRC1R_EVT15SRC     HSP_EVTSRC1R_EVT15SRC_Msk            /*!< EVT15SRC[2:0] bits (Event source selection for priority encoder input 15) */
#define HSP_EVTSRC1R_EVT15SRC_0   (0x1UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x01000000 */
#define HSP_EVTSRC1R_EVT15SRC_1   (0x2UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x02000000 */
#define HSP_EVTSRC1R_EVT15SRC_2   (0x4UL << HSP_EVTSRC1R_EVT15SRC_Pos) /*!< 0x04000000 */
/*!< EVT16SRC configuration */
#define HSP_EVTSRC1R_EVT16SRC_Pos (28U)
#define HSP_EVTSRC1R_EVT16SRC_Msk (0x7UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x70000000 */
#define HSP_EVTSRC1R_EVT16SRC     HSP_EVTSRC1R_EVT16SRC_Msk            /*!< EVT16SRC[2:0] bits (Event source selection for priority encoder input 16) */
#define HSP_EVTSRC1R_EVT16SRC_0   (0x1UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x10000000 */
#define HSP_EVTSRC1R_EVT16SRC_1   (0x2UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x20000000 */
#define HSP_EVTSRC1R_EVT16SRC_2   (0x4UL << HSP_EVTSRC1R_EVT16SRC_Pos) /*!< 0x40000000 */

/********************  Bit definition for HSP_EVTSRC2R register  ********************/
/*!< EVT17SRC configuration */
#define HSP_EVTSRC2R_EVT17SRC_Pos (0U)
#define HSP_EVTSRC2R_EVT17SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000007 */
#define HSP_EVTSRC2R_EVT17SRC     HSP_EVTSRC2R_EVT17SRC_Msk            /*!< EVT17SRC[2:0] bits (Event source selection for priority encoder input 17) */
#define HSP_EVTSRC2R_EVT17SRC_0   (0x1UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000001 */
#define HSP_EVTSRC2R_EVT17SRC_1   (0x2UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000002 */
#define HSP_EVTSRC2R_EVT17SRC_2   (0x4UL << HSP_EVTSRC2R_EVT17SRC_Pos) /*!< 0x00000004 */
/*!< EVT18SRC configuration */
#define HSP_EVTSRC2R_EVT18SRC_Pos (4U)
#define HSP_EVTSRC2R_EVT18SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000070 */
#define HSP_EVTSRC2R_EVT18SRC     HSP_EVTSRC2R_EVT18SRC_Msk            /*!< EVT18SRC[2:0] bits (Event source selection for priority encoder input 18) */
#define HSP_EVTSRC2R_EVT18SRC_0   (0x1UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000010 */
#define HSP_EVTSRC2R_EVT18SRC_1   (0x2UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000020 */
#define HSP_EVTSRC2R_EVT18SRC_2   (0x4UL << HSP_EVTSRC2R_EVT18SRC_Pos) /*!< 0x00000040 */
/*!< EVT19SRC configuration */
#define HSP_EVTSRC2R_EVT19SRC_Pos (8U)
#define HSP_EVTSRC2R_EVT19SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000700 */
#define HSP_EVTSRC2R_EVT19SRC     HSP_EVTSRC2R_EVT19SRC_Msk            /*!< EVT19SRC[2:0] bits (Event source selection for priority encoder input 19) */
#define HSP_EVTSRC2R_EVT19SRC_0   (0x1UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000100 */
#define HSP_EVTSRC2R_EVT19SRC_1   (0x2UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000200 */
#define HSP_EVTSRC2R_EVT19SRC_2   (0x4UL << HSP_EVTSRC2R_EVT19SRC_Pos) /*!< 0x00000400 */
/*!< EVT20SRC configuration */
#define HSP_EVTSRC2R_EVT20SRC_Pos (12U)
#define HSP_EVTSRC2R_EVT20SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00007000 */
#define HSP_EVTSRC2R_EVT20SRC     HSP_EVTSRC2R_EVT20SRC_Msk            /*!< EVT20SRC[2:0] bits (Event source selection for priority encoder input 20) */
#define HSP_EVTSRC2R_EVT20SRC_0   (0x1UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00001000 */
#define HSP_EVTSRC2R_EVT20SRC_1   (0x2UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00002000 */
#define HSP_EVTSRC2R_EVT20SRC_2   (0x4UL << HSP_EVTSRC2R_EVT20SRC_Pos) /*!< 0x00004000 */
/*!< EVT21SRC configuration */
#define HSP_EVTSRC2R_EVT21SRC_Pos (16U)
#define HSP_EVTSRC2R_EVT21SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00070000 */
#define HSP_EVTSRC2R_EVT21SRC     HSP_EVTSRC2R_EVT21SRC_Msk            /*!< EVT21SRC[2:0] bits (Event source selection for priority encoder input 21) */
#define HSP_EVTSRC2R_EVT21SRC_0   (0x1UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00010000 */
#define HSP_EVTSRC2R_EVT21SRC_1   (0x2UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00020000 */
#define HSP_EVTSRC2R_EVT21SRC_2   (0x4UL << HSP_EVTSRC2R_EVT21SRC_Pos) /*!< 0x00040000 */
/*!< EVT22SRC configuration */
#define HSP_EVTSRC2R_EVT22SRC_Pos (20U)
#define HSP_EVTSRC2R_EVT22SRC_Msk (0x7UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00700000 */
#define HSP_EVTSRC2R_EVT22SRC     HSP_EVTSRC2R_EVT22SRC_Msk            /*!< EVT22SRC[2:0] bits (Event source selection for priority encoder input 22) */
#define HSP_EVTSRC2R_EVT22SRC_0   (0x1UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00100000 */
#define HSP_EVTSRC2R_EVT22SRC_1   (0x2UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00200000 */
#define HSP_EVTSRC2R_EVT22SRC_2   (0x4UL << HSP_EVTSRC2R_EVT22SRC_Pos) /*!< 0x00400000 */

