stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_BKO0CFGR register  ********************/
/*!< ACCEREN configuration */
#define HSP_BKO0CFGR_ACCEREN_Pos  (0U)
#define HSP_BKO0CFGR_ACCEREN_Msk  (0x1UL << HSP_BKO0CFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKO0CFGR_ACCEREN      HSP_BKO0CFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */
/*!< FPUEREN configuration */
#define HSP_BKO0CFGR_FPUEREN_Pos  (1U)
#define HSP_BKO0CFGR_FPUEREN_Msk  (0x1UL << HSP_BKO0CFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKO0CFGR_FPUEREN      HSP_BKO0CFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */
/*!< OPCEREN configuration */
#define HSP_BKO0CFGR_OPCEREN_Pos  (2U)
#define HSP_BKO0CFGR_OPCEREN_Msk  (0x1UL << HSP_BKO0CFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKO0CFGR_OPCEREN      HSP_BKO0CFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */
/*!< PFCT28EN configuration */
#define HSP_BKO0CFGR_PFCT28EN_Pos (4U)
#define HSP_BKO0CFGR_PFCT28EN_Msk (0x1UL << HSP_BKO0CFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKO0CFGR_PFCT28EN     HSP_BKO0CFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */
/*!< PFCT29EN configuration */
#define HSP_BKO0CFGR_PFCT29EN_Pos (5U)
#define HSP_BKO0CFGR_PFCT29EN_Msk (0x1UL << HSP_BKO0CFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKO0CFGR_PFCT29EN     HSP_BKO0CFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */
/*!< PFCT30EN configuration */
#define HSP_BKO0CFGR_PFCT30EN_Pos (6U)
#define HSP_BKO0CFGR_PFCT30EN_Msk (0x1UL << HSP_BKO0CFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKO0CFGR_PFCT30EN     HSP_BKO0CFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */
/*!< PFCT31EN configuration */
#define HSP_BKO0CFGR_PFCT31EN_Pos (7U)
#define HSP_BKO0CFGR_PFCT31EN_Msk (0x1UL << HSP_BKO0CFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKO0CFGR_PFCT31EN     HSP_BKO0CFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */
/*!< FWEREN configuration */
#define HSP_BKO0CFGR_FWEREN_Pos   (12U)
#define HSP_BKO0CFGR_FWEREN_Msk   (0x1UL << HSP_BKO0CFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKO0CFGR_FWEREN       HSP_BKO0CFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */
/*!< HDEGOVEN configuration */
#define HSP_BKO0CFGR_HDEGOVEN_Pos (13U)
#define HSP_BKO0CFGR_HDEGOVEN_Msk (0x1UL << HSP_BKO0CFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKO0CFGR_HDEGOVEN     HSP_BKO0CFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

/********************  Bit definition for HSP_BKO1CFGR register  ********************/
/*!< ACCEREN configuration */
#define HSP_BKO1CFGR_ACCEREN_Pos  (0U)
#define HSP_BKO1CFGR_ACCEREN_Msk  (0x1UL << HSP_BKO1CFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKO1CFGR_ACCEREN      HSP_BKO1CFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */
/*!< FPUEREN configuration */
#define HSP_BKO1CFGR_FPUEREN_Pos  (1U)
#define HSP_BKO1CFGR_FPUEREN_Msk  (0x1UL << HSP_BKO1CFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKO1CFGR_FPUEREN      HSP_BKO1CFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */
/*!< OPCEREN configuration */
#define HSP_BKO1CFGR_OPCEREN_Pos  (2U)
#define HSP_BKO1CFGR_OPCEREN_Msk  (0x1UL << HSP_BKO1CFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKO1CFGR_OPCEREN      HSP_BKO1CFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */
/*!< PFCT28EN configuration */
#define HSP_BKO1CFGR_PFCT28EN_Pos (4U)
#define HSP_BKO1CFGR_PFCT28EN_Msk (0x1UL << HSP_BKO1CFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKO1CFGR_PFCT28EN     HSP_BKO1CFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */
/*!< PFCT29EN configuration */
#define HSP_BKO1CFGR_PFCT29EN_Pos (5U)
#define HSP_BKO1CFGR_PFCT29EN_Msk (0x1UL << HSP_BKO1CFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKO1CFGR_PFCT29EN     HSP_BKO1CFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */
/*!< PFCT30EN configuration */
#define HSP_BKO1CFGR_PFCT30EN_Pos (6U)
#define HSP_BKO1CFGR_PFCT30EN_Msk (0x1UL << HSP_BKO1CFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKO1CFGR_PFCT30EN     HSP_BKO1CFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */
/*!< PFCT31EN configuration */
#define HSP_BKO1CFGR_PFCT31EN_Pos (7U)
#define HSP_BKO1CFGR_PFCT31EN_Msk (0x1UL << HSP_BKO1CFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKO1CFGR_PFCT31EN     HSP_BKO1CFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */
/*!< FWEREN configuration */
#define HSP_BKO1CFGR_FWEREN_Pos   (12U)
#define HSP_BKO1CFGR_FWEREN_Msk   (0x1UL << HSP_BKO1CFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKO1CFGR_FWEREN       HSP_BKO1CFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */
/*!< HDEGOVEN configuration */
#define HSP_BKO1CFGR_HDEGOVEN_Pos (13U)
#define HSP_BKO1CFGR_HDEGOVEN_Msk (0x1UL << HSP_BKO1CFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKO1CFGR_HDEGOVEN     HSP_BKO1CFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

/********************  Bit definition for HSP_BKO2CFGR register  ********************/
/*!< ACCEREN configuration */
#define HSP_BKO2CFGR_ACCEREN_Pos  (0U)
#define HSP_BKO2CFGR_ACCEREN_Msk  (0x1UL << HSP_BKO2CFGR_ACCEREN_Pos)  /*!< 0x00000001 */
#define HSP_BKO2CFGR_ACCEREN      HSP_BKO2CFGR_ACCEREN_Msk             /*!< ACCEREN (Access error break enable for ACCERRF <sup>(1)</sup>) */
/*!< FPUEREN configuration */
#define HSP_BKO2CFGR_FPUEREN_Pos  (1U)
#define HSP_BKO2CFGR_FPUEREN_Msk  (0x1UL << HSP_BKO2CFGR_FPUEREN_Pos)  /*!< 0x00000002 */
#define HSP_BKO2CFGR_FPUEREN      HSP_BKO2CFGR_FPUEREN_Msk             /*!< FPUEREN (FPU error break enable for FPUERRF <sup>(1)</sup>) */
/*!< OPCEREN configuration */
#define HSP_BKO2CFGR_OPCEREN_Pos  (2U)
#define HSP_BKO2CFGR_OPCEREN_Msk  (0x1UL << HSP_BKO2CFGR_OPCEREN_Pos)  /*!< 0x00000004 */
#define HSP_BKO2CFGR_OPCEREN      HSP_BKO2CFGR_OPCEREN_Msk             /*!< OPCEREN (Opcode error break enable for OPCOERRF ) */
/*!< PFCT28EN configuration */
#define HSP_BKO2CFGR_PFCT28EN_Pos (4U)
#define HSP_BKO2CFGR_PFCT28EN_Msk (0x1UL << HSP_BKO2CFGR_PFCT28EN_Pos) /*!< 0x00000010 */
#define HSP_BKO2CFGR_PFCT28EN     HSP_BKO2CFGR_PFCT28EN_Msk            /*!< PFCT28EN (Processing function flag break enable for PFCTF[28] <sup>(1)</sup>) */
/*!< PFCT29EN configuration */
#define HSP_BKO2CFGR_PFCT29EN_Pos (5U)
#define HSP_BKO2CFGR_PFCT29EN_Msk (0x1UL << HSP_BKO2CFGR_PFCT29EN_Pos) /*!< 0x00000020 */
#define HSP_BKO2CFGR_PFCT29EN     HSP_BKO2CFGR_PFCT29EN_Msk            /*!< PFCT29EN (Processing function flag break enable for PFCTF[29] <sup>(1)</sup>) */
/*!< PFCT30EN configuration */
#define HSP_BKO2CFGR_PFCT30EN_Pos (6U)
#define HSP_BKO2CFGR_PFCT30EN_Msk (0x1UL << HSP_BKO2CFGR_PFCT30EN_Pos) /*!< 0x00000040 */
#define HSP_BKO2CFGR_PFCT30EN     HSP_BKO2CFGR_PFCT30EN_Msk            /*!< PFCT30EN (Processing function flag break enable for PFCTF[30] <sup>(1)</sup>) */
/*!< PFCT31EN configuration */
#define HSP_BKO2CFGR_PFCT31EN_Pos (7U)
#define HSP_BKO2CFGR_PFCT31EN_Msk (0x1UL << HSP_BKO2CFGR_PFCT31EN_Pos) /*!< 0x00000080 */
#define HSP_BKO2CFGR_PFCT31EN     HSP_BKO2CFGR_PFCT31EN_Msk            /*!< PFCT31EN (Processing function flag break enable for PFCTF[31] <sup>(1)</sup>) */
/*!< FWEREN configuration */
#define HSP_BKO2CFGR_FWEREN_Pos   (12U)
#define HSP_BKO2CFGR_FWEREN_Msk   (0x1UL << HSP_BKO2CFGR_FWEREN_Pos)   /*!< 0x00001000 */
#define HSP_BKO2CFGR_FWEREN       HSP_BKO2CFGR_FWEREN_Msk              /*!< FWEREN (Firmware error break enable for FWERRF <sup>(1)</sup>) */
/*!< HDEGOVEN configuration */
#define HSP_BKO2CFGR_HDEGOVEN_Pos (13U)
#define HSP_BKO2CFGR_HDEGOVEN_Msk (0x1UL << HSP_BKO2CFGR_HDEGOVEN_Pos) /*!< 0x00002000 */
#define HSP_BKO2CFGR_HDEGOVEN     HSP_BKO2CFGR_HDEGOVEN_Msk            /*!< HDEGOVEN (HSP dedicated event generator overrun break enable for HDEGOVRF <sup>(1)</sup>) */

