stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_PARAMR2 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR2_PARAM_Pos (0U)
#define HSP_PARAMR2_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR2_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR2_PARAM     HSP_PARAMR2_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR2_PARAM_0   (0x00001UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR2_PARAM_1   (0x00002UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR2_PARAM_2   (0x00004UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR2_PARAM_3   (0x00008UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR2_PARAM_4   (0x00010UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR2_PARAM_5   (0x00020UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR2_PARAM_6   (0x00040UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR2_PARAM_7   (0x00080UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR2_PARAM_8   (0x00100UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR2_PARAM_9   (0x00200UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR2_PARAM_10  (0x00400UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR2_PARAM_11  (0x00800UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR2_PARAM_12  (0x01000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR2_PARAM_13  (0x02000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR2_PARAM_14  (0x04000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR2_PARAM_15  (0x08000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR2_PARAM_16  (0x10000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR2_PARAM_17  (0x20000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR2_PARAM_18  (0x40000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR2_PARAM_19  (0x80000UL << HSP_PARAMR2_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR2_PARAM_20  (0x100000UL << HSP_PARAMR2_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR2_PARAM_21  (0x200000UL << HSP_PARAMR2_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR2_PARAM_22  (0x400000UL << HSP_PARAMR2_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR2_PARAM_23  (0x800000UL << HSP_PARAMR2_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR2_PARAM_24  (0x1000000UL << HSP_PARAMR2_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR2_PARAM_25  (0x2000000UL << HSP_PARAMR2_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR2_PARAM_26  (0x4000000UL << HSP_PARAMR2_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR2_PARAM_27  (0x8000000UL << HSP_PARAMR2_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR2_PARAM_28  (0x10000000UL << HSP_PARAMR2_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR2_PARAM_29  (0x20000000UL << HSP_PARAMR2_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR2_PARAM_30  (0x40000000UL << HSP_PARAMR2_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR2_PARAM_31  (0x80000000UL << HSP_PARAMR2_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR3 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR3_PARAM_Pos (0U)
#define HSP_PARAMR3_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR3_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR3_PARAM     HSP_PARAMR3_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR3_PARAM_0   (0x00001UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR3_PARAM_1   (0x00002UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR3_PARAM_2   (0x00004UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR3_PARAM_3   (0x00008UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR3_PARAM_4   (0x00010UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR3_PARAM_5   (0x00020UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR3_PARAM_6   (0x00040UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR3_PARAM_7   (0x00080UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR3_PARAM_8   (0x00100UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR3_PARAM_9   (0x00200UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR3_PARAM_10  (0x00400UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR3_PARAM_11  (0x00800UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR3_PARAM_12  (0x01000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR3_PARAM_13  (0x02000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR3_PARAM_14  (0x04000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR3_PARAM_15  (0x08000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR3_PARAM_16  (0x10000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR3_PARAM_17  (0x20000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR3_PARAM_18  (0x40000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR3_PARAM_19  (0x80000UL << HSP_PARAMR3_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR3_PARAM_20  (0x100000UL << HSP_PARAMR3_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR3_PARAM_21  (0x200000UL << HSP_PARAMR3_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR3_PARAM_22  (0x400000UL << HSP_PARAMR3_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR3_PARAM_23  (0x800000UL << HSP_PARAMR3_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR3_PARAM_24  (0x1000000UL << HSP_PARAMR3_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR3_PARAM_25  (0x2000000UL << HSP_PARAMR3_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR3_PARAM_26  (0x4000000UL << HSP_PARAMR3_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR3_PARAM_27  (0x8000000UL << HSP_PARAMR3_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR3_PARAM_28  (0x10000000UL << HSP_PARAMR3_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR3_PARAM_29  (0x20000000UL << HSP_PARAMR3_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR3_PARAM_30  (0x40000000UL << HSP_PARAMR3_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR3_PARAM_31  (0x80000000UL << HSP_PARAMR3_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR4 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR4_PARAM_Pos (0U)
#define HSP_PARAMR4_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR4_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR4_PARAM     HSP_PARAMR4_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR4_PARAM_0   (0x00001UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR4_PARAM_1   (0x00002UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR4_PARAM_2   (0x00004UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR4_PARAM_3   (0x00008UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR4_PARAM_4   (0x00010UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR4_PARAM_5   (0x00020UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR4_PARAM_6   (0x00040UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR4_PARAM_7   (0x00080UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR4_PARAM_8   (0x00100UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR4_PARAM_9   (0x00200UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR4_PARAM_10  (0x00400UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR4_PARAM_11  (0x00800UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR4_PARAM_12  (0x01000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR4_PARAM_13  (0x02000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR4_PARAM_14  (0x04000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR4_PARAM_15  (0x08000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR4_PARAM_16  (0x10000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR4_PARAM_17  (0x20000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR4_PARAM_18  (0x40000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR4_PARAM_19  (0x80000UL << HSP_PARAMR4_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR4_PARAM_20  (0x100000UL << HSP_PARAMR4_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR4_PARAM_21  (0x200000UL << HSP_PARAMR4_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR4_PARAM_22  (0x400000UL << HSP_PARAMR4_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR4_PARAM_23  (0x800000UL << HSP_PARAMR4_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR4_PARAM_24  (0x1000000UL << HSP_PARAMR4_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR4_PARAM_25  (0x2000000UL << HSP_PARAMR4_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR4_PARAM_26  (0x4000000UL << HSP_PARAMR4_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR4_PARAM_27  (0x8000000UL << HSP_PARAMR4_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR4_PARAM_28  (0x10000000UL << HSP_PARAMR4_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR4_PARAM_29  (0x20000000UL << HSP_PARAMR4_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR4_PARAM_30  (0x40000000UL << HSP_PARAMR4_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR4_PARAM_31  (0x80000000UL << HSP_PARAMR4_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR5 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR5_PARAM_Pos (0U)
#define HSP_PARAMR5_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR5_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR5_PARAM     HSP_PARAMR5_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR5_PARAM_0   (0x00001UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR5_PARAM_1   (0x00002UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR5_PARAM_2   (0x00004UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR5_PARAM_3   (0x00008UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR5_PARAM_4   (0x00010UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR5_PARAM_5   (0x00020UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR5_PARAM_6   (0x00040UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR5_PARAM_7   (0x00080UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR5_PARAM_8   (0x00100UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR5_PARAM_9   (0x00200UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR5_PARAM_10  (0x00400UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR5_PARAM_11  (0x00800UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR5_PARAM_12  (0x01000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR5_PARAM_13  (0x02000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR5_PARAM_14  (0x04000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR5_PARAM_15  (0x08000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR5_PARAM_16  (0x10000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR5_PARAM_17  (0x20000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR5_PARAM_18  (0x40000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR5_PARAM_19  (0x80000UL << HSP_PARAMR5_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR5_PARAM_20  (0x100000UL << HSP_PARAMR5_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR5_PARAM_21  (0x200000UL << HSP_PARAMR5_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR5_PARAM_22  (0x400000UL << HSP_PARAMR5_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR5_PARAM_23  (0x800000UL << HSP_PARAMR5_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR5_PARAM_24  (0x1000000UL << HSP_PARAMR5_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR5_PARAM_25  (0x2000000UL << HSP_PARAMR5_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR5_PARAM_26  (0x4000000UL << HSP_PARAMR5_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR5_PARAM_27  (0x8000000UL << HSP_PARAMR5_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR5_PARAM_28  (0x10000000UL << HSP_PARAMR5_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR5_PARAM_29  (0x20000000UL << HSP_PARAMR5_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR5_PARAM_30  (0x40000000UL << HSP_PARAMR5_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR5_PARAM_31  (0x80000000UL << HSP_PARAMR5_PARAM_Pos) /*!< 0x80000000 */

