stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_PARAMR9 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR9_PARAM_Pos (0U)
#define HSP_PARAMR9_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR9_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR9_PARAM     HSP_PARAMR9_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR9_PARAM_0   (0x00001UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR9_PARAM_1   (0x00002UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR9_PARAM_2   (0x00004UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR9_PARAM_3   (0x00008UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR9_PARAM_4   (0x00010UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR9_PARAM_5   (0x00020UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR9_PARAM_6   (0x00040UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR9_PARAM_7   (0x00080UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR9_PARAM_8   (0x00100UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR9_PARAM_9   (0x00200UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR9_PARAM_10  (0x00400UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR9_PARAM_11  (0x00800UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR9_PARAM_12  (0x01000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR9_PARAM_13  (0x02000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR9_PARAM_14  (0x04000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR9_PARAM_15  (0x08000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR9_PARAM_16  (0x10000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR9_PARAM_17  (0x20000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR9_PARAM_18  (0x40000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR9_PARAM_19  (0x80000UL << HSP_PARAMR9_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR9_PARAM_20  (0x100000UL << HSP_PARAMR9_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR9_PARAM_21  (0x200000UL << HSP_PARAMR9_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR9_PARAM_22  (0x400000UL << HSP_PARAMR9_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR9_PARAM_23  (0x800000UL << HSP_PARAMR9_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR9_PARAM_24  (0x1000000UL << HSP_PARAMR9_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR9_PARAM_25  (0x2000000UL << HSP_PARAMR9_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR9_PARAM_26  (0x4000000UL << HSP_PARAMR9_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR9_PARAM_27  (0x8000000UL << HSP_PARAMR9_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR9_PARAM_28  (0x10000000UL << HSP_PARAMR9_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR9_PARAM_29  (0x20000000UL << HSP_PARAMR9_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR9_PARAM_30  (0x40000000UL << HSP_PARAMR9_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR9_PARAM_31  (0x80000000UL << HSP_PARAMR9_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR10 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR10_PARAM_Pos (0U)
#define HSP_PARAMR10_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR10_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR10_PARAM     HSP_PARAMR10_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR10_PARAM_0   (0x00001UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR10_PARAM_1   (0x00002UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR10_PARAM_2   (0x00004UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR10_PARAM_3   (0x00008UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR10_PARAM_4   (0x00010UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR10_PARAM_5   (0x00020UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR10_PARAM_6   (0x00040UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR10_PARAM_7   (0x00080UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR10_PARAM_8   (0x00100UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR10_PARAM_9   (0x00200UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR10_PARAM_10  (0x00400UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR10_PARAM_11  (0x00800UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR10_PARAM_12  (0x01000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR10_PARAM_13  (0x02000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR10_PARAM_14  (0x04000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR10_PARAM_15  (0x08000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR10_PARAM_16  (0x10000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR10_PARAM_17  (0x20000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR10_PARAM_18  (0x40000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR10_PARAM_19  (0x80000UL << HSP_PARAMR10_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR10_PARAM_20  (0x100000UL << HSP_PARAMR10_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR10_PARAM_21  (0x200000UL << HSP_PARAMR10_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR10_PARAM_22  (0x400000UL << HSP_PARAMR10_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR10_PARAM_23  (0x800000UL << HSP_PARAMR10_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR10_PARAM_24  (0x1000000UL << HSP_PARAMR10_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR10_PARAM_25  (0x2000000UL << HSP_PARAMR10_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR10_PARAM_26  (0x4000000UL << HSP_PARAMR10_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR10_PARAM_27  (0x8000000UL << HSP_PARAMR10_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR10_PARAM_28  (0x10000000UL << HSP_PARAMR10_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR10_PARAM_29  (0x20000000UL << HSP_PARAMR10_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR10_PARAM_30  (0x40000000UL << HSP_PARAMR10_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR10_PARAM_31  (0x80000000UL << HSP_PARAMR10_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR11 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR11_PARAM_Pos (0U)
#define HSP_PARAMR11_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR11_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR11_PARAM     HSP_PARAMR11_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR11_PARAM_0   (0x00001UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR11_PARAM_1   (0x00002UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR11_PARAM_2   (0x00004UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR11_PARAM_3   (0x00008UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR11_PARAM_4   (0x00010UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR11_PARAM_5   (0x00020UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR11_PARAM_6   (0x00040UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR11_PARAM_7   (0x00080UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR11_PARAM_8   (0x00100UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR11_PARAM_9   (0x00200UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR11_PARAM_10  (0x00400UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR11_PARAM_11  (0x00800UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR11_PARAM_12  (0x01000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR11_PARAM_13  (0x02000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR11_PARAM_14  (0x04000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR11_PARAM_15  (0x08000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR11_PARAM_16  (0x10000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR11_PARAM_17  (0x20000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR11_PARAM_18  (0x40000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR11_PARAM_19  (0x80000UL << HSP_PARAMR11_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR11_PARAM_20  (0x100000UL << HSP_PARAMR11_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR11_PARAM_21  (0x200000UL << HSP_PARAMR11_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR11_PARAM_22  (0x400000UL << HSP_PARAMR11_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR11_PARAM_23  (0x800000UL << HSP_PARAMR11_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR11_PARAM_24  (0x1000000UL << HSP_PARAMR11_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR11_PARAM_25  (0x2000000UL << HSP_PARAMR11_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR11_PARAM_26  (0x4000000UL << HSP_PARAMR11_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR11_PARAM_27  (0x8000000UL << HSP_PARAMR11_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR11_PARAM_28  (0x10000000UL << HSP_PARAMR11_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR11_PARAM_29  (0x20000000UL << HSP_PARAMR11_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR11_PARAM_30  (0x40000000UL << HSP_PARAMR11_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR11_PARAM_31  (0x80000000UL << HSP_PARAMR11_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR12 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR12_PARAM_Pos (0U)
#define HSP_PARAMR12_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR12_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR12_PARAM     HSP_PARAMR12_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR12_PARAM_0   (0x00001UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR12_PARAM_1   (0x00002UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR12_PARAM_2   (0x00004UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR12_PARAM_3   (0x00008UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR12_PARAM_4   (0x00010UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR12_PARAM_5   (0x00020UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR12_PARAM_6   (0x00040UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR12_PARAM_7   (0x00080UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR12_PARAM_8   (0x00100UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR12_PARAM_9   (0x00200UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR12_PARAM_10  (0x00400UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR12_PARAM_11  (0x00800UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR12_PARAM_12  (0x01000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR12_PARAM_13  (0x02000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR12_PARAM_14  (0x04000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR12_PARAM_15  (0x08000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR12_PARAM_16  (0x10000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR12_PARAM_17  (0x20000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR12_PARAM_18  (0x40000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR12_PARAM_19  (0x80000UL << HSP_PARAMR12_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR12_PARAM_20  (0x100000UL << HSP_PARAMR12_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR12_PARAM_21  (0x200000UL << HSP_PARAMR12_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR12_PARAM_22  (0x400000UL << HSP_PARAMR12_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR12_PARAM_23  (0x800000UL << HSP_PARAMR12_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR12_PARAM_24  (0x1000000UL << HSP_PARAMR12_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR12_PARAM_25  (0x2000000UL << HSP_PARAMR12_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR12_PARAM_26  (0x4000000UL << HSP_PARAMR12_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR12_PARAM_27  (0x8000000UL << HSP_PARAMR12_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR12_PARAM_28  (0x10000000UL << HSP_PARAMR12_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR12_PARAM_29  (0x20000000UL << HSP_PARAMR12_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR12_PARAM_30  (0x40000000UL << HSP_PARAMR12_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR12_PARAM_31  (0x80000000UL << HSP_PARAMR12_PARAM_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_PARAMR13 register  ********************/
/*!< PARAM configuration */
#define HSP_PARAMR13_PARAM_Pos (0U)
#define HSP_PARAMR13_PARAM_Msk (0xFFFFFFFFUL << HSP_PARAMR13_PARAM_Pos) /*!< 0xFFFFFFFF */
#define HSP_PARAMR13_PARAM     HSP_PARAMR13_PARAM_Msk                   /*!< PARAM[31:0] bits (Parameter value) */
#define HSP_PARAMR13_PARAM_0   (0x00001UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000001 */
#define HSP_PARAMR13_PARAM_1   (0x00002UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000002 */
#define HSP_PARAMR13_PARAM_2   (0x00004UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000004 */
#define HSP_PARAMR13_PARAM_3   (0x00008UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000008 */
#define HSP_PARAMR13_PARAM_4   (0x00010UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000010 */
#define HSP_PARAMR13_PARAM_5   (0x00020UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000020 */
#define HSP_PARAMR13_PARAM_6   (0x00040UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000040 */
#define HSP_PARAMR13_PARAM_7   (0x00080UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000080 */
#define HSP_PARAMR13_PARAM_8   (0x00100UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000100 */
#define HSP_PARAMR13_PARAM_9   (0x00200UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000200 */
#define HSP_PARAMR13_PARAM_10  (0x00400UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000400 */
#define HSP_PARAMR13_PARAM_11  (0x00800UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00000800 */
#define HSP_PARAMR13_PARAM_12  (0x01000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00001000 */
#define HSP_PARAMR13_PARAM_13  (0x02000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00002000 */
#define HSP_PARAMR13_PARAM_14  (0x04000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00004000 */
#define HSP_PARAMR13_PARAM_15  (0x08000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00008000 */
#define HSP_PARAMR13_PARAM_16  (0x10000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00010000 */
#define HSP_PARAMR13_PARAM_17  (0x20000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00020000 */
#define HSP_PARAMR13_PARAM_18  (0x40000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00040000 */
#define HSP_PARAMR13_PARAM_19  (0x80000UL << HSP_PARAMR13_PARAM_Pos)    /*!< 0x00080000 */
#define HSP_PARAMR13_PARAM_20  (0x100000UL << HSP_PARAMR13_PARAM_Pos)   /*!< 0x00100000 */
#define HSP_PARAMR13_PARAM_21  (0x200000UL << HSP_PARAMR13_PARAM_Pos)   /*!< 0x00200000 */
#define HSP_PARAMR13_PARAM_22  (0x400000UL << HSP_PARAMR13_PARAM_Pos)   /*!< 0x00400000 */
#define HSP_PARAMR13_PARAM_23  (0x800000UL << HSP_PARAMR13_PARAM_Pos)   /*!< 0x00800000 */
#define HSP_PARAMR13_PARAM_24  (0x1000000UL << HSP_PARAMR13_PARAM_Pos)  /*!< 0x01000000 */
#define HSP_PARAMR13_PARAM_25  (0x2000000UL << HSP_PARAMR13_PARAM_Pos)  /*!< 0x02000000 */
#define HSP_PARAMR13_PARAM_26  (0x4000000UL << HSP_PARAMR13_PARAM_Pos)  /*!< 0x04000000 */
#define HSP_PARAMR13_PARAM_27  (0x8000000UL << HSP_PARAMR13_PARAM_Pos)  /*!< 0x08000000 */
#define HSP_PARAMR13_PARAM_28  (0x10000000UL << HSP_PARAMR13_PARAM_Pos) /*!< 0x10000000 */
#define HSP_PARAMR13_PARAM_29  (0x20000000UL << HSP_PARAMR13_PARAM_Pos) /*!< 0x20000000 */
#define HSP_PARAMR13_PARAM_30  (0x40000000UL << HSP_PARAMR13_PARAM_Pos) /*!< 0x40000000 */
#define HSP_PARAMR13_PARAM_31  (0x80000000UL << HSP_PARAMR13_PARAM_Pos) /*!< 0x80000000 */

