stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_EVT_IER register  ********************/
/*!< H2CMRDYIE configuration */
#define HSP_EVT_IER_H2CMRDYIE_Pos  (0U)
#define HSP_EVT_IER_H2CMRDYIE_Msk  (0x1UL << HSP_EVT_IER_H2CMRDYIE_Pos)  /*!< 0x00000001 */
#define HSP_EVT_IER_H2CMRDYIE      HSP_EVT_IER_H2CMRDYIE_Msk             /*!< H2CMRDYIE (HSP to CPU message ready interrupt enable) */
/*!< C2HMFREEIE configuration */
#define HSP_EVT_IER_C2HMFREEIE_Pos (1U)
#define HSP_EVT_IER_C2HMFREEIE_Msk (0x1UL << HSP_EVT_IER_C2HMFREEIE_Pos) /*!< 0x00000002 */
#define HSP_EVT_IER_C2HMFREEIE     HSP_EVT_IER_C2HMFREEIE_Msk            /*!< C2HMFREEIE (CPU to HSP message box free interrupt enable) */
/*!< DCDONEIE configuration */
#define HSP_EVT_IER_DCDONEIE_Pos   (2U)
#define HSP_EVT_IER_DCDONEIE_Msk   (0x1UL << HSP_EVT_IER_DCDONEIE_Pos)   /*!< 0x00000004 */
#define HSP_EVT_IER_DCDONEIE       HSP_EVT_IER_DCDONEIE_Msk              /*!< DCDONEIE (Direct command done interrupt enable) */
/*!< CAPRDYIE configuration */
#define HSP_EVT_IER_CAPRDYIE_Pos   (4U)
#define HSP_EVT_IER_CAPRDYIE_Msk   (0x1UL << HSP_EVT_IER_CAPRDYIE_Pos)   /*!< 0x00000010 */
#define HSP_EVT_IER_CAPRDYIE       HSP_EVT_IER_CAPRDYIE_Msk              /*!< CAPRDYIE (Capture buffer data ready interrupt enable) */
/*!< CDEGRDYIE configuration */
#define HSP_EVT_IER_CDEGRDYIE_Pos  (7U)
#define HSP_EVT_IER_CDEGRDYIE_Msk  (0x1UL << HSP_EVT_IER_CDEGRDYIE_Pos)  /*!< 0x00000080 */
#define HSP_EVT_IER_CDEGRDYIE      HSP_EVT_IER_CDEGRDYIE_Msk             /*!< CDEGRDYIE (CPU Dedicated event generator ready interrupt enable) */
/*!< SOFWFEIE configuration */
#define HSP_EVT_IER_SOFWFEIE_Pos   (8U)
#define HSP_EVT_IER_SOFWFEIE_Msk   (0x1UL << HSP_EVT_IER_SOFWFEIE_Pos)   /*!< 0x00000100 */
#define HSP_EVT_IER_SOFWFEIE       HSP_EVT_IER_SOFWFEIE_Msk              /*!< SOFWFEIE (Start of WFE interrupt enable) */
/*!< EOFWFEIE configuration */
#define HSP_EVT_IER_EOFWFEIE_Pos   (9U)
#define HSP_EVT_IER_EOFWFEIE_Msk   (0x1UL << HSP_EVT_IER_EOFWFEIE_Pos)   /*!< 0x00000200 */
#define HSP_EVT_IER_EOFWFEIE       HSP_EVT_IER_EOFWFEIE_Msk              /*!< EOFWFEIE (End of WFE interrupt enable) */
/*!< B0EVTIE configuration */
#define HSP_EVT_IER_B0EVTIE_Pos    (12U)
#define HSP_EVT_IER_B0EVTIE_Msk    (0x1UL << HSP_EVT_IER_B0EVTIE_Pos)    /*!< 0x00001000 */
#define HSP_EVT_IER_B0EVTIE        HSP_EVT_IER_B0EVTIE_Msk               /*!< B0EVTIE (BUFF0 event interrupt enable) */
/*!< B1EVTIE configuration */
#define HSP_EVT_IER_B1EVTIE_Pos    (13U)
#define HSP_EVT_IER_B1EVTIE_Msk    (0x1UL << HSP_EVT_IER_B1EVTIE_Pos)    /*!< 0x00002000 */
#define HSP_EVT_IER_B1EVTIE        HSP_EVT_IER_B1EVTIE_Msk               /*!< B1EVTIE (BUFF1 event interrupt enable) */
/*!< B2EVTIE configuration */
#define HSP_EVT_IER_B2EVTIE_Pos    (14U)
#define HSP_EVT_IER_B2EVTIE_Msk    (0x1UL << HSP_EVT_IER_B2EVTIE_Pos)    /*!< 0x00004000 */
#define HSP_EVT_IER_B2EVTIE        HSP_EVT_IER_B2EVTIE_Msk               /*!< B2EVTIE (BUFF2 event interrupt enable) */
/*!< B3EVTIE configuration */
#define HSP_EVT_IER_B3EVTIE_Pos    (15U)
#define HSP_EVT_IER_B3EVTIE_Msk    (0x1UL << HSP_EVT_IER_B3EVTIE_Pos)    /*!< 0x00008000 */
#define HSP_EVT_IER_B3EVTIE        HSP_EVT_IER_B3EVTIE_Msk               /*!< B3EVTIE (BUFF3 event interrupt enable) */
/*!< SOTECP0IE configuration */
#define HSP_EVT_IER_SOTECP0IE_Pos  (16U)
#define HSP_EVT_IER_SOTECP0IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP0IE_Pos)  /*!< 0x00010000 */
#define HSP_EVT_IER_SOTECP0IE      HSP_EVT_IER_SOTECP0IE_Msk             /*!< SOTECP0IE (Start of task generated by event comparator 0 interrupt enable) */
/*!< SOTECP1IE configuration */
#define HSP_EVT_IER_SOTECP1IE_Pos  (17U)
#define HSP_EVT_IER_SOTECP1IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP1IE_Pos)  /*!< 0x00020000 */
#define HSP_EVT_IER_SOTECP1IE      HSP_EVT_IER_SOTECP1IE_Msk             /*!< SOTECP1IE (Start of task generated by event comparator 1 interrupt enable) */
/*!< SOTECP2IE configuration */
#define HSP_EVT_IER_SOTECP2IE_Pos  (18U)
#define HSP_EVT_IER_SOTECP2IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP2IE_Pos)  /*!< 0x00040000 */
#define HSP_EVT_IER_SOTECP2IE      HSP_EVT_IER_SOTECP2IE_Msk             /*!< SOTECP2IE (Start of task generated by event comparator 2 interrupt enable) */
/*!< SOTECP3IE configuration */
#define HSP_EVT_IER_SOTECP3IE_Pos  (19U)
#define HSP_EVT_IER_SOTECP3IE_Msk  (0x1UL << HSP_EVT_IER_SOTECP3IE_Pos)  /*!< 0x00080000 */
#define HSP_EVT_IER_SOTECP3IE      HSP_EVT_IER_SOTECP3IE_Msk             /*!< SOTECP3IE (Start of task generated by event comparator 3 interrupt enable) */
/*!< EOTECP0IE configuration */
#define HSP_EVT_IER_EOTECP0IE_Pos  (20U)
#define HSP_EVT_IER_EOTECP0IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP0IE_Pos)  /*!< 0x00100000 */
#define HSP_EVT_IER_EOTECP0IE      HSP_EVT_IER_EOTECP0IE_Msk             /*!< EOTECP0IE (End of task generated by event comparator 0 interrupt enable) */
/*!< EOTECP1IE configuration */
#define HSP_EVT_IER_EOTECP1IE_Pos  (21U)
#define HSP_EVT_IER_EOTECP1IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP1IE_Pos)  /*!< 0x00200000 */
#define HSP_EVT_IER_EOTECP1IE      HSP_EVT_IER_EOTECP1IE_Msk             /*!< EOTECP1IE (End of task generated by event comparator 1 interrupt enable) */
/*!< EOTECP2IE configuration */
#define HSP_EVT_IER_EOTECP2IE_Pos  (22U)
#define HSP_EVT_IER_EOTECP2IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP2IE_Pos)  /*!< 0x00400000 */
#define HSP_EVT_IER_EOTECP2IE      HSP_EVT_IER_EOTECP2IE_Msk             /*!< EOTECP2IE (End of task generated by event comparator 2 interrupt enable) */
/*!< EOTECP3IE configuration */
#define HSP_EVT_IER_EOTECP3IE_Pos  (23U)
#define HSP_EVT_IER_EOTECP3IE_Msk  (0x1UL << HSP_EVT_IER_EOTECP3IE_Pos)  /*!< 0x00800000 */
#define HSP_EVT_IER_EOTECP3IE      HSP_EVT_IER_EOTECP3IE_Msk             /*!< EOTECP3IE (End of task generated by event comparator 3 interrupt enable) */
/*!< TOVLPIE configuration */
#define HSP_EVT_IER_TOVLPIE_Pos    (28U)
#define HSP_EVT_IER_TOVLPIE_Msk    (0x1UL << HSP_EVT_IER_TOVLPIE_Pos)    /*!< 0x10000000 */
#define HSP_EVT_IER_TOVLPIE        HSP_EVT_IER_TOVLPIE_Msk               /*!< TOVLPIE (Task overlap flag interrupt enable) */
/*!< FPUSATIE configuration */
#define HSP_EVT_IER_FPUSATIE_Pos   (31U)
#define HSP_EVT_IER_FPUSATIE_Msk   (0x1UL << HSP_EVT_IER_FPUSATIE_Pos)   /*!< 0x80000000 */
#define HSP_EVT_IER_FPUSATIE       HSP_EVT_IER_FPUSATIE_Msk              /*!< FPUSATIE (Saturation flag interrupt enable) */

/********************  Bit definition for HSP_PFCTEVT_IER register  ********************/
/*!< PFCTIE configuration */
#define HSP_PFCTEVT_IER_PFCTIE_Pos (0U)
#define HSP_PFCTEVT_IER_PFCTIE_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_IER_PFCTIE     HSP_PFCTEVT_IER_PFCTIE_Msk                   /*!< PFCTIE[31:0] bits (Processing function flags interrupt enable) */
#define HSP_PFCTEVT_IER_PFCTIE_0   (0x00001UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_IER_PFCTIE_1   (0x00002UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_IER_PFCTIE_2   (0x00004UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_IER_PFCTIE_3   (0x00008UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_IER_PFCTIE_4   (0x00010UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_IER_PFCTIE_5   (0x00020UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_IER_PFCTIE_6   (0x00040UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_IER_PFCTIE_7   (0x00080UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_IER_PFCTIE_8   (0x00100UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_IER_PFCTIE_9   (0x00200UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_IER_PFCTIE_10  (0x00400UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_IER_PFCTIE_11  (0x00800UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_IER_PFCTIE_12  (0x01000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_IER_PFCTIE_13  (0x02000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_IER_PFCTIE_14  (0x04000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_IER_PFCTIE_15  (0x08000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_IER_PFCTIE_16  (0x10000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_IER_PFCTIE_17  (0x20000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_IER_PFCTIE_18  (0x40000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_IER_PFCTIE_19  (0x80000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_IER_PFCTIE_20  (0x100000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_IER_PFCTIE_21  (0x200000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_IER_PFCTIE_22  (0x400000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_IER_PFCTIE_23  (0x800000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_IER_PFCTIE_24  (0x1000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_IER_PFCTIE_25  (0x2000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_IER_PFCTIE_26  (0x4000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_IER_PFCTIE_27  (0x8000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_IER_PFCTIE_28  (0x10000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_IER_PFCTIE_29  (0x20000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_IER_PFCTIE_30  (0x40000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_IER_PFCTIE_31  (0x80000000UL << HSP_PFCTEVT_IER_PFCTIE_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_ERR_ISR register  ********************/
/*!< TRGIOVRF configuration */
#define HSP_ERR_ISR_TRGIOVRF_Pos (8U)
#define HSP_ERR_ISR_TRGIOVRF_Msk (0x1UL << HSP_ERR_ISR_TRGIOVRF_Pos) /*!< 0x00000100 */
#define HSP_ERR_ISR_TRGIOVRF     HSP_ERR_ISR_TRGIOVRF_Msk            /*!< TRGIOVRF (TRGITF overrun flag) */
/*!< B0ERRF configuration */
#define HSP_ERR_ISR_B0ERRF_Pos   (12U)
#define HSP_ERR_ISR_B0ERRF_Msk   (0x1UL << HSP_ERR_ISR_B0ERRF_Pos)   /*!< 0x00001000 */
#define HSP_ERR_ISR_B0ERRF       HSP_ERR_ISR_B0ERRF_Msk              /*!< B0ERRF (H2CBUFF0 underrun or C2HBUFF0 overrun flag) */
/*!< B1ERRF configuration */
#define HSP_ERR_ISR_B1ERRF_Pos   (13U)
#define HSP_ERR_ISR_B1ERRF_Msk   (0x1UL << HSP_ERR_ISR_B1ERRF_Pos)   /*!< 0x00002000 */
#define HSP_ERR_ISR_B1ERRF       HSP_ERR_ISR_B1ERRF_Msk              /*!< B1ERRF (H2CBUFF1 underrun or C2HBUFF1 overrun flag) */
/*!< B2ERRF configuration */
#define HSP_ERR_ISR_B2ERRF_Pos   (14U)
#define HSP_ERR_ISR_B2ERRF_Msk   (0x1UL << HSP_ERR_ISR_B2ERRF_Pos)   /*!< 0x00004000 */
#define HSP_ERR_ISR_B2ERRF       HSP_ERR_ISR_B2ERRF_Msk              /*!< B2ERRF (H2CBUFF2 underrun or C2HBUFF2 overrun flag) */
/*!< B3ERRF configuration */
#define HSP_ERR_ISR_B3ERRF_Pos   (15U)
#define HSP_ERR_ISR_B3ERRF_Msk   (0x1UL << HSP_ERR_ISR_B3ERRF_Pos)   /*!< 0x00008000 */
#define HSP_ERR_ISR_B3ERRF       HSP_ERR_ISR_B3ERRF_Msk              /*!< B3ERRF (H2CBUFF3 underrun or C2HBUFF3 overrun flag) */
/*!< CAPOVRF configuration */
#define HSP_ERR_ISR_CAPOVRF_Pos  (16U)
#define HSP_ERR_ISR_CAPOVRF_Msk  (0x1UL << HSP_ERR_ISR_CAPOVRF_Pos)  /*!< 0x00010000 */
#define HSP_ERR_ISR_CAPOVRF      HSP_ERR_ISR_CAPOVRF_Msk             /*!< CAPOVRF (Capture register overrun flag) */
/*!< FWERRF configuration */
#define HSP_ERR_ISR_FWERRF_Pos   (17U)
#define HSP_ERR_ISR_FWERRF_Msk   (0x1UL << HSP_ERR_ISR_FWERRF_Pos)   /*!< 0x00020000 */
#define HSP_ERR_ISR_FWERRF       HSP_ERR_ISR_FWERRF_Msk              /*!< FWERRF (Firmware error flag) */
/*!< SCHERRF configuration */
#define HSP_ERR_ISR_SCHERRF_Pos  (18U)
#define HSP_ERR_ISR_SCHERRF_Msk  (0x1UL << HSP_ERR_ISR_SCHERRF_Pos)  /*!< 0x00040000 */
#define HSP_ERR_ISR_SCHERRF      HSP_ERR_ISR_SCHERRF_Msk             /*!< SCHERRF (Scheduler error flag) */
/*!< BKINF configuration */
#define HSP_ERR_ISR_BKINF_Pos    (19U)
#define HSP_ERR_ISR_BKINF_Msk    (0x1UL << HSP_ERR_ISR_BKINF_Pos)    /*!< 0x00080000 */
#define HSP_ERR_ISR_BKINF        HSP_ERR_ISR_BKINF_Msk               /*!< BKINF (Break input flag) */
/*!< HDEGOVRF configuration */
#define HSP_ERR_ISR_HDEGOVRF_Pos (20U)
#define HSP_ERR_ISR_HDEGOVRF_Msk (0x1UL << HSP_ERR_ISR_HDEGOVRF_Pos) /*!< 0x00100000 */
#define HSP_ERR_ISR_HDEGOVRF     HSP_ERR_ISR_HDEGOVRF_Msk            /*!< HDEGOVRF (SPE event overrun flag) */
/*!< OPCOERRF configuration */
#define HSP_ERR_ISR_OPCOERRF_Pos (22U)
#define HSP_ERR_ISR_OPCOERRF_Msk (0x1UL << HSP_ERR_ISR_OPCOERRF_Pos) /*!< 0x00400000 */
#define HSP_ERR_ISR_OPCOERRF     HSP_ERR_ISR_OPCOERRF_Msk            /*!< OPCOERRF (Invalid OpCode error flag) */
/*!< ACCERRF configuration */
#define HSP_ERR_ISR_ACCERRF_Pos  (23U)
#define HSP_ERR_ISR_ACCERRF_Msk  (0x1UL << HSP_ERR_ISR_ACCERRF_Pos)  /*!< 0x00800000 */
#define HSP_ERR_ISR_ACCERRF      HSP_ERR_ISR_ACCERRF_Msk             /*!< ACCERRF (SPE Access error flag) */
/*!< FPUERRF configuration */
#define HSP_ERR_ISR_FPUERRF_Pos  (24U)
#define HSP_ERR_ISR_FPUERRF_Msk  (0x1UL << HSP_ERR_ISR_FPUERRF_Pos)  /*!< 0x01000000 */
#define HSP_ERR_ISR_FPUERRF      HSP_ERR_ISR_FPUERRF_Msk             /*!< FPUERRF (Computation error flag) */

/********************  Bit definition for HSP_EVT_ISR register  ********************/
/*!< H2CMRDYF configuration */
#define HSP_EVT_ISR_H2CMRDYF_Pos  (0U)
#define HSP_EVT_ISR_H2CMRDYF_Msk  (0x1UL << HSP_EVT_ISR_H2CMRDYF_Pos)  /*!< 0x00000001 */
#define HSP_EVT_ISR_H2CMRDYF      HSP_EVT_ISR_H2CMRDYF_Msk             /*!< H2CMRDYF (HSP to CPU message ready flag) */
/*!< C2HMFREEF configuration */
#define HSP_EVT_ISR_C2HMFREEF_Pos (1U)
#define HSP_EVT_ISR_C2HMFREEF_Msk (0x1UL << HSP_EVT_ISR_C2HMFREEF_Pos) /*!< 0x00000002 */
#define HSP_EVT_ISR_C2HMFREEF     HSP_EVT_ISR_C2HMFREEF_Msk            /*!< C2HMFREEF (CPU to HSP message box free flag) */
/*!< DCDONEF configuration */
#define HSP_EVT_ISR_DCDONEF_Pos   (2U)
#define HSP_EVT_ISR_DCDONEF_Msk   (0x1UL << HSP_EVT_ISR_DCDONEF_Pos)   /*!< 0x00000004 */
#define HSP_EVT_ISR_DCDONEF       HSP_EVT_ISR_DCDONEF_Msk              /*!< DCDONEF (Direct command done flag) */
/*!< CAPRDYF configuration */
#define HSP_EVT_ISR_CAPRDYF_Pos   (4U)
#define HSP_EVT_ISR_CAPRDYF_Msk   (0x1UL << HSP_EVT_ISR_CAPRDYF_Pos)   /*!< 0x00000010 */
#define HSP_EVT_ISR_CAPRDYF       HSP_EVT_ISR_CAPRDYF_Msk              /*!< CAPRDYF (Capture buffer data ready flag) */
/*!< CDEGRDYF configuration */
#define HSP_EVT_ISR_CDEGRDYF_Pos  (7U)
#define HSP_EVT_ISR_CDEGRDYF_Msk  (0x1UL << HSP_EVT_ISR_CDEGRDYF_Pos)  /*!< 0x00000080 */
#define HSP_EVT_ISR_CDEGRDYF      HSP_EVT_ISR_CDEGRDYF_Msk             /*!< CDEGRDYF (CPU Dedicated event generator ready flag) */
/*!< SOFWFEF configuration */
#define HSP_EVT_ISR_SOFWFEF_Pos   (8U)
#define HSP_EVT_ISR_SOFWFEF_Msk   (0x1UL << HSP_EVT_ISR_SOFWFEF_Pos)   /*!< 0x00000100 */
#define HSP_EVT_ISR_SOFWFEF       HSP_EVT_ISR_SOFWFEF_Msk              /*!< SOFWFEF (Start of WFE flag) */
/*!< EOFWFEF configuration */
#define HSP_EVT_ISR_EOFWFEF_Pos   (9U)
#define HSP_EVT_ISR_EOFWFEF_Msk   (0x1UL << HSP_EVT_ISR_EOFWFEF_Pos)   /*!< 0x00000200 */
#define HSP_EVT_ISR_EOFWFEF       HSP_EVT_ISR_EOFWFEF_Msk              /*!< EOFWFEF (End of WFE flag) */
/*!< B0EVTF configuration */
#define HSP_EVT_ISR_B0EVTF_Pos    (12U)
#define HSP_EVT_ISR_B0EVTF_Msk    (0x1UL << HSP_EVT_ISR_B0EVTF_Pos)    /*!< 0x00001000 */
#define HSP_EVT_ISR_B0EVTF        HSP_EVT_ISR_B0EVTF_Msk               /*!< B0EVTF (BUFF0 event flag) */
/*!< B1EVTF configuration */
#define HSP_EVT_ISR_B1EVTF_Pos    (13U)
#define HSP_EVT_ISR_B1EVTF_Msk    (0x1UL << HSP_EVT_ISR_B1EVTF_Pos)    /*!< 0x00002000 */
#define HSP_EVT_ISR_B1EVTF        HSP_EVT_ISR_B1EVTF_Msk               /*!< B1EVTF (BUFF1 event flag) */
/*!< B2EVTF configuration */
#define HSP_EVT_ISR_B2EVTF_Pos    (14U)
#define HSP_EVT_ISR_B2EVTF_Msk    (0x1UL << HSP_EVT_ISR_B2EVTF_Pos)    /*!< 0x00004000 */
#define HSP_EVT_ISR_B2EVTF        HSP_EVT_ISR_B2EVTF_Msk               /*!< B2EVTF (BUFF2 event flag) */
/*!< B3EVTF configuration */
#define HSP_EVT_ISR_B3EVTF_Pos    (15U)
#define HSP_EVT_ISR_B3EVTF_Msk    (0x1UL << HSP_EVT_ISR_B3EVTF_Pos)    /*!< 0x00008000 */
#define HSP_EVT_ISR_B3EVTF        HSP_EVT_ISR_B3EVTF_Msk               /*!< B3EVTF (BUFF3 event flag) */
/*!< SOTECP0F configuration */
#define HSP_EVT_ISR_SOTECP0F_Pos  (16U)
#define HSP_EVT_ISR_SOTECP0F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP0F_Pos)  /*!< 0x00010000 */
#define HSP_EVT_ISR_SOTECP0F      HSP_EVT_ISR_SOTECP0F_Msk             /*!< SOTECP0F (Start of task flag, for event comparator 0) */
/*!< SOTECP1F configuration */
#define HSP_EVT_ISR_SOTECP1F_Pos  (17U)
#define HSP_EVT_ISR_SOTECP1F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP1F_Pos)  /*!< 0x00020000 */
#define HSP_EVT_ISR_SOTECP1F      HSP_EVT_ISR_SOTECP1F_Msk             /*!< SOTECP1F (Start of task flag, for event comparator 1) */
/*!< SOTECP2F configuration */
#define HSP_EVT_ISR_SOTECP2F_Pos  (18U)
#define HSP_EVT_ISR_SOTECP2F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP2F_Pos)  /*!< 0x00040000 */
#define HSP_EVT_ISR_SOTECP2F      HSP_EVT_ISR_SOTECP2F_Msk             /*!< SOTECP2F (Start of task flag, for event comparator 2) */
/*!< SOTECP3F configuration */
#define HSP_EVT_ISR_SOTECP3F_Pos  (19U)
#define HSP_EVT_ISR_SOTECP3F_Msk  (0x1UL << HSP_EVT_ISR_SOTECP3F_Pos)  /*!< 0x00080000 */
#define HSP_EVT_ISR_SOTECP3F      HSP_EVT_ISR_SOTECP3F_Msk             /*!< SOTECP3F (Start of task flag, for event comparator 3) */
/*!< EOTECP0F configuration */
#define HSP_EVT_ISR_EOTECP0F_Pos  (20U)
#define HSP_EVT_ISR_EOTECP0F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP0F_Pos)  /*!< 0x00100000 */
#define HSP_EVT_ISR_EOTECP0F      HSP_EVT_ISR_EOTECP0F_Msk             /*!< EOTECP0F (End of task flag, for event comparator 0) */
/*!< EOTECP1F configuration */
#define HSP_EVT_ISR_EOTECP1F_Pos  (21U)
#define HSP_EVT_ISR_EOTECP1F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP1F_Pos)  /*!< 0x00200000 */
#define HSP_EVT_ISR_EOTECP1F      HSP_EVT_ISR_EOTECP1F_Msk             /*!< EOTECP1F (End of task flag, for event comparator 1) */
/*!< EOTECP2F configuration */
#define HSP_EVT_ISR_EOTECP2F_Pos  (22U)
#define HSP_EVT_ISR_EOTECP2F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP2F_Pos)  /*!< 0x00400000 */
#define HSP_EVT_ISR_EOTECP2F      HSP_EVT_ISR_EOTECP2F_Msk             /*!< EOTECP2F (End of task flag, for event comparator 2) */
/*!< EOTECP3F configuration */
#define HSP_EVT_ISR_EOTECP3F_Pos  (23U)
#define HSP_EVT_ISR_EOTECP3F_Msk  (0x1UL << HSP_EVT_ISR_EOTECP3F_Pos)  /*!< 0x00800000 */
#define HSP_EVT_ISR_EOTECP3F      HSP_EVT_ISR_EOTECP3F_Msk             /*!< EOTECP3F (End of task flag, for event comparator 3) */
/*!< TOVLPF configuration */
#define HSP_EVT_ISR_TOVLPF_Pos    (28U)
#define HSP_EVT_ISR_TOVLPF_Msk    (0x1UL << HSP_EVT_ISR_TOVLPF_Pos)    /*!< 0x10000000 */
#define HSP_EVT_ISR_TOVLPF        HSP_EVT_ISR_TOVLPF_Msk               /*!< TOVLPF (Task overlap flag) */
/*!< FPUSATF configuration */
#define HSP_EVT_ISR_FPUSATF_Pos   (31U)
#define HSP_EVT_ISR_FPUSATF_Msk   (0x1UL << HSP_EVT_ISR_FPUSATF_Pos)   /*!< 0x80000000 */
#define HSP_EVT_ISR_FPUSATF       HSP_EVT_ISR_FPUSATF_Msk              /*!< FPUSATF (FPU saturation flag) */

