stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_PFCTEVT_ISR register  ********************/
/*!< PFCTF configuration */
#define HSP_PFCTEVT_ISR_PFCTF_Pos (0U)
#define HSP_PFCTEVT_ISR_PFCTF_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_ISR_PFCTF     HSP_PFCTEVT_ISR_PFCTF_Msk                   /*!< PFCTF[31:0] bits (Flags generated by SPE processing functions ) */
#define HSP_PFCTEVT_ISR_PFCTF_0   (0x00001UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_ISR_PFCTF_1   (0x00002UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_ISR_PFCTF_2   (0x00004UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_ISR_PFCTF_3   (0x00008UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_ISR_PFCTF_4   (0x00010UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_ISR_PFCTF_5   (0x00020UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_ISR_PFCTF_6   (0x00040UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_ISR_PFCTF_7   (0x00080UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_ISR_PFCTF_8   (0x00100UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_ISR_PFCTF_9   (0x00200UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_ISR_PFCTF_10  (0x00400UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_ISR_PFCTF_11  (0x00800UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_ISR_PFCTF_12  (0x01000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_ISR_PFCTF_13  (0x02000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_ISR_PFCTF_14  (0x04000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_ISR_PFCTF_15  (0x08000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_ISR_PFCTF_16  (0x10000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_ISR_PFCTF_17  (0x20000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_ISR_PFCTF_18  (0x40000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_ISR_PFCTF_19  (0x80000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_ISR_PFCTF_20  (0x100000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_ISR_PFCTF_21  (0x200000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_ISR_PFCTF_22  (0x400000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_ISR_PFCTF_23  (0x800000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_ISR_PFCTF_24  (0x1000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_ISR_PFCTF_25  (0x2000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_ISR_PFCTF_26  (0x4000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_ISR_PFCTF_27  (0x8000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_ISR_PFCTF_28  (0x10000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_ISR_PFCTF_29  (0x20000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_ISR_PFCTF_30  (0x40000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_ISR_PFCTF_31  (0x80000000UL << HSP_PFCTEVT_ISR_PFCTF_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_ERRINFR register  ********************/
/*!< INEXACT configuration */
#define HSP_ERRINFR_INEXACT_Pos (0U)
#define HSP_ERRINFR_INEXACT_Msk (0x1UL << HSP_ERRINFR_INEXACT_Pos)   /*!< 0x00000001 */
#define HSP_ERRINFR_INEXACT     HSP_ERRINFR_INEXACT_Msk              /*!< INEXACT (INEXACT exception flag) */
/*!< UDFLOW configuration */
#define HSP_ERRINFR_UDFLOW_Pos  (1U)
#define HSP_ERRINFR_UDFLOW_Msk  (0x1UL << HSP_ERRINFR_UDFLOW_Pos)    /*!< 0x00000002 */
#define HSP_ERRINFR_UDFLOW      HSP_ERRINFR_UDFLOW_Msk               /*!< UDFLOW (UNDERFLOW exception flag) */
/*!< OVFLOW configuration */
#define HSP_ERRINFR_OVFLOW_Pos  (2U)
#define HSP_ERRINFR_OVFLOW_Msk  (0x1UL << HSP_ERRINFR_OVFLOW_Pos)    /*!< 0x00000004 */
#define HSP_ERRINFR_OVFLOW      HSP_ERRINFR_OVFLOW_Msk               /*!< OVFLOW (OVERFLOW exception flag) */
/*!< DIVZERO configuration */
#define HSP_ERRINFR_DIVZERO_Pos (3U)
#define HSP_ERRINFR_DIVZERO_Msk (0x1UL << HSP_ERRINFR_DIVZERO_Pos)   /*!< 0x00000008 */
#define HSP_ERRINFR_DIVZERO     HSP_ERRINFR_DIVZERO_Msk              /*!< DIVZERO (Division by zero exception flag) */
/*!< INVALID configuration */
#define HSP_ERRINFR_INVALID_Pos (4U)
#define HSP_ERRINFR_INVALID_Msk (0x1UL << HSP_ERRINFR_INVALID_Pos)   /*!< 0x00000010 */
#define HSP_ERRINFR_INVALID     HSP_ERRINFR_INVALID_Msk              /*!< INVALID (INVALID exception flag) */
/*!< DENORM configuration */
#define HSP_ERRINFR_DENORM_Pos  (5U)
#define HSP_ERRINFR_DENORM_Msk  (0x1UL << HSP_ERRINFR_DENORM_Pos)    /*!< 0x00000020 */
#define HSP_ERRINFR_DENORM      HSP_ERRINFR_DENORM_Msk               /*!< DENORM (DENORMAL exception flag) */
/*!< CMERR configuration */
#define HSP_ERRINFR_CMERR_Pos   (8U)
#define HSP_ERRINFR_CMERR_Msk   (0x1UL << HSP_ERRINFR_CMERR_Pos)     /*!< 0x00000100 */
#define HSP_ERRINFR_CMERR       HSP_ERRINFR_CMERR_Msk                /*!< CMERR (Code memory access error flag) */
/*!< DMERR configuration */
#define HSP_ERRINFR_DMERR_Pos   (9U)
#define HSP_ERRINFR_DMERR_Msk   (0x1UL << HSP_ERRINFR_DMERR_Pos)     /*!< 0x00000200 */
#define HSP_ERRINFR_DMERR       HSP_ERRINFR_DMERR_Msk                /*!< DMERR (Data memory access error flag) */
/*!< MAHBERR configuration */
#define HSP_ERRINFR_MAHBERR_Pos (11U)
#define HSP_ERRINFR_MAHBERR_Msk (0x1UL << HSP_ERRINFR_MAHBERR_Pos)   /*!< 0x00000800 */
#define HSP_ERRINFR_MAHBERR     HSP_ERRINFR_MAHBERR_Msk              /*!< MAHBERR (Internal AHB access error flag) */
/*!< SAHBERR configuration */
#define HSP_ERRINFR_SAHBERR_Pos (12U)
#define HSP_ERRINFR_SAHBERR_Msk (0x1UL << HSP_ERRINFR_SAHBERR_Pos)   /*!< 0x00001000 */
#define HSP_ERRINFR_SAHBERR     HSP_ERRINFR_SAHBERR_Msk              /*!< SAHBERR (Slave AHB access error flag) */
/*!< TRGIERR configuration */
#define HSP_ERRINFR_TRGIERR_Pos (16U)
#define HSP_ERRINFR_TRGIERR_Msk (0x3FFUL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x03FF0000 */
#define HSP_ERRINFR_TRGIERR     HSP_ERRINFR_TRGIERR_Msk              /*!< TRGIERR[9:0] bits (TRGIN error information) */
#define HSP_ERRINFR_TRGIERR_0   (0x001UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00010000 */
#define HSP_ERRINFR_TRGIERR_1   (0x002UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00020000 */
#define HSP_ERRINFR_TRGIERR_2   (0x004UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00040000 */
#define HSP_ERRINFR_TRGIERR_3   (0x008UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00080000 */
#define HSP_ERRINFR_TRGIERR_4   (0x010UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00100000 */
#define HSP_ERRINFR_TRGIERR_5   (0x020UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00200000 */
#define HSP_ERRINFR_TRGIERR_6   (0x040UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00400000 */
#define HSP_ERRINFR_TRGIERR_7   (0x080UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x00800000 */
#define HSP_ERRINFR_TRGIERR_8   (0x100UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x01000000 */
#define HSP_ERRINFR_TRGIERR_9   (0x200UL << HSP_ERRINFR_TRGIERR_Pos) /*!< 0x02000000 */

/********************  Bit definition for HSP_ERR_ICR register  ********************/
/*!< TRGIOVRC configuration */
#define HSP_ERR_ICR_TRGIOVRC_Pos (8U)
#define HSP_ERR_ICR_TRGIOVRC_Msk (0x1UL << HSP_ERR_ICR_TRGIOVRC_Pos) /*!< 0x00000100 */
#define HSP_ERR_ICR_TRGIOVRC     HSP_ERR_ICR_TRGIOVRC_Msk            /*!< TRGIOVRC (Clear TRGIOVRF flag) */
/*!< B0ERRC configuration */
#define HSP_ERR_ICR_B0ERRC_Pos   (12U)
#define HSP_ERR_ICR_B0ERRC_Msk   (0x1UL << HSP_ERR_ICR_B0ERRC_Pos)   /*!< 0x00001000 */
#define HSP_ERR_ICR_B0ERRC       HSP_ERR_ICR_B0ERRC_Msk              /*!< B0ERRC (Clear B0ERRF flag) */
/*!< B1ERRC configuration */
#define HSP_ERR_ICR_B1ERRC_Pos   (13U)
#define HSP_ERR_ICR_B1ERRC_Msk   (0x1UL << HSP_ERR_ICR_B1ERRC_Pos)   /*!< 0x00002000 */
#define HSP_ERR_ICR_B1ERRC       HSP_ERR_ICR_B1ERRC_Msk              /*!< B1ERRC (Clear B1ERRF flag) */
/*!< B2ERRC configuration */
#define HSP_ERR_ICR_B2ERRC_Pos   (14U)
#define HSP_ERR_ICR_B2ERRC_Msk   (0x1UL << HSP_ERR_ICR_B2ERRC_Pos)   /*!< 0x00004000 */
#define HSP_ERR_ICR_B2ERRC       HSP_ERR_ICR_B2ERRC_Msk              /*!< B2ERRC (Clear B2ERRF flag) */
/*!< B3ERRC configuration */
#define HSP_ERR_ICR_B3ERRC_Pos   (15U)
#define HSP_ERR_ICR_B3ERRC_Msk   (0x1UL << HSP_ERR_ICR_B3ERRC_Pos)   /*!< 0x00008000 */
#define HSP_ERR_ICR_B3ERRC       HSP_ERR_ICR_B3ERRC_Msk              /*!< B3ERRC (Clear B3ERRF flag) */
/*!< CAPOVRC configuration */
#define HSP_ERR_ICR_CAPOVRC_Pos  (16U)
#define HSP_ERR_ICR_CAPOVRC_Msk  (0x1UL << HSP_ERR_ICR_CAPOVRC_Pos)  /*!< 0x00010000 */
#define HSP_ERR_ICR_CAPOVRC      HSP_ERR_ICR_CAPOVRC_Msk             /*!< CAPOVRC (Clear CAPOVRF flag) */
/*!< FWERRC configuration */
#define HSP_ERR_ICR_FWERRC_Pos   (17U)
#define HSP_ERR_ICR_FWERRC_Msk   (0x1UL << HSP_ERR_ICR_FWERRC_Pos)   /*!< 0x00020000 */
#define HSP_ERR_ICR_FWERRC       HSP_ERR_ICR_FWERRC_Msk              /*!< FWERRC (Clear FWERRF flag) */
/*!< SCHERRC configuration */
#define HSP_ERR_ICR_SCHERRC_Pos  (18U)
#define HSP_ERR_ICR_SCHERRC_Msk  (0x1UL << HSP_ERR_ICR_SCHERRC_Pos)  /*!< 0x00040000 */
#define HSP_ERR_ICR_SCHERRC      HSP_ERR_ICR_SCHERRC_Msk             /*!< SCHERRC (Clear SCHERRF flag) */
/*!< BKINC configuration */
#define HSP_ERR_ICR_BKINC_Pos    (19U)
#define HSP_ERR_ICR_BKINC_Msk    (0x1UL << HSP_ERR_ICR_BKINC_Pos)    /*!< 0x00080000 */
#define HSP_ERR_ICR_BKINC        HSP_ERR_ICR_BKINC_Msk               /*!< BKINC (Clear BKINF flag) */
/*!< HDEGOVRC configuration */
#define HSP_ERR_ICR_HDEGOVRC_Pos (20U)
#define HSP_ERR_ICR_HDEGOVRC_Msk (0x1UL << HSP_ERR_ICR_HDEGOVRC_Pos) /*!< 0x00100000 */
#define HSP_ERR_ICR_HDEGOVRC     HSP_ERR_ICR_HDEGOVRC_Msk            /*!< HDEGOVRC (Clear HDEGOVRF flag) */
/*!< OPCOERRC configuration */
#define HSP_ERR_ICR_OPCOERRC_Pos (22U)
#define HSP_ERR_ICR_OPCOERRC_Msk (0x1UL << HSP_ERR_ICR_OPCOERRC_Pos) /*!< 0x00400000 */
#define HSP_ERR_ICR_OPCOERRC     HSP_ERR_ICR_OPCOERRC_Msk            /*!< OPCOERRC (Clear OPCOERRF flag) */
/*!< ACCERRC configuration */
#define HSP_ERR_ICR_ACCERRC_Pos  (23U)
#define HSP_ERR_ICR_ACCERRC_Msk  (0x1UL << HSP_ERR_ICR_ACCERRC_Pos)  /*!< 0x00800000 */
#define HSP_ERR_ICR_ACCERRC      HSP_ERR_ICR_ACCERRC_Msk             /*!< ACCERRC (Clear ACCERRF flag) */
/*!< FPUERRC configuration */
#define HSP_ERR_ICR_FPUERRC_Pos  (24U)
#define HSP_ERR_ICR_FPUERRC_Msk  (0x1UL << HSP_ERR_ICR_FPUERRC_Pos)  /*!< 0x01000000 */
#define HSP_ERR_ICR_FPUERRC      HSP_ERR_ICR_FPUERRC_Msk             /*!< FPUERRC (Clear FPUERRF flag) */

/********************  Bit definition for HSP_EVT_ICR register  ********************/
/*!< H2CMRDYC configuration */
#define HSP_EVT_ICR_H2CMRDYC_Pos  (0U)
#define HSP_EVT_ICR_H2CMRDYC_Msk  (0x1UL << HSP_EVT_ICR_H2CMRDYC_Pos)  /*!< 0x00000001 */
#define HSP_EVT_ICR_H2CMRDYC      HSP_EVT_ICR_H2CMRDYC_Msk             /*!< H2CMRDYC (Clear H2CMRDYF flag) */
/*!< C2HMFREEC configuration */
#define HSP_EVT_ICR_C2HMFREEC_Pos (1U)
#define HSP_EVT_ICR_C2HMFREEC_Msk (0x1UL << HSP_EVT_ICR_C2HMFREEC_Pos) /*!< 0x00000002 */
#define HSP_EVT_ICR_C2HMFREEC     HSP_EVT_ICR_C2HMFREEC_Msk            /*!< C2HMFREEC (Clear C2HMFREEF flag) */
/*!< DCDONEC configuration */
#define HSP_EVT_ICR_DCDONEC_Pos   (2U)
#define HSP_EVT_ICR_DCDONEC_Msk   (0x1UL << HSP_EVT_ICR_DCDONEC_Pos)   /*!< 0x00000004 */
#define HSP_EVT_ICR_DCDONEC       HSP_EVT_ICR_DCDONEC_Msk              /*!< DCDONEC (Clear DCDONEF flag) */
/*!< CDEGRDYC configuration */
#define HSP_EVT_ICR_CDEGRDYC_Pos  (7U)
#define HSP_EVT_ICR_CDEGRDYC_Msk  (0x1UL << HSP_EVT_ICR_CDEGRDYC_Pos)  /*!< 0x00000080 */
#define HSP_EVT_ICR_CDEGRDYC      HSP_EVT_ICR_CDEGRDYC_Msk             /*!< CDEGRDYC (Clear of CDEGRDYF flag) */
/*!< SOFWFEC configuration */
#define HSP_EVT_ICR_SOFWFEC_Pos   (8U)
#define HSP_EVT_ICR_SOFWFEC_Msk   (0x1UL << HSP_EVT_ICR_SOFWFEC_Pos)   /*!< 0x00000100 */
#define HSP_EVT_ICR_SOFWFEC       HSP_EVT_ICR_SOFWFEC_Msk              /*!< SOFWFEC (Clear of SOFWFEF flag) */
/*!< EOFWFEC configuration */
#define HSP_EVT_ICR_EOFWFEC_Pos   (9U)
#define HSP_EVT_ICR_EOFWFEC_Msk   (0x1UL << HSP_EVT_ICR_EOFWFEC_Pos)   /*!< 0x00000200 */
#define HSP_EVT_ICR_EOFWFEC       HSP_EVT_ICR_EOFWFEC_Msk              /*!< EOFWFEC (Clear of EOFWFEF flag) */
/*!< SOTECP0C configuration */
#define HSP_EVT_ICR_SOTECP0C_Pos  (16U)
#define HSP_EVT_ICR_SOTECP0C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP0C_Pos)  /*!< 0x00010000 */
#define HSP_EVT_ICR_SOTECP0C      HSP_EVT_ICR_SOTECP0C_Msk             /*!< SOTECP0C (Clear SOTECP0F flag) */
/*!< SOTECP1C configuration */
#define HSP_EVT_ICR_SOTECP1C_Pos  (17U)
#define HSP_EVT_ICR_SOTECP1C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP1C_Pos)  /*!< 0x00020000 */
#define HSP_EVT_ICR_SOTECP1C      HSP_EVT_ICR_SOTECP1C_Msk             /*!< SOTECP1C (Clear SOTECP1F flag) */
/*!< SOTECP2C configuration */
#define HSP_EVT_ICR_SOTECP2C_Pos  (18U)
#define HSP_EVT_ICR_SOTECP2C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP2C_Pos)  /*!< 0x00040000 */
#define HSP_EVT_ICR_SOTECP2C      HSP_EVT_ICR_SOTECP2C_Msk             /*!< SOTECP2C (Clear SOTECP2F flag) */
/*!< SOTECP3C configuration */
#define HSP_EVT_ICR_SOTECP3C_Pos  (19U)
#define HSP_EVT_ICR_SOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_SOTECP3C_Pos)  /*!< 0x00080000 */
#define HSP_EVT_ICR_SOTECP3C      HSP_EVT_ICR_SOTECP3C_Msk             /*!< SOTECP3C (Clear SOTECP3F flag) */
/*!< EOTECP0C configuration */
#define HSP_EVT_ICR_EOTECP0C_Pos  (20U)
#define HSP_EVT_ICR_EOTECP0C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP0C_Pos)  /*!< 0x00100000 */
#define HSP_EVT_ICR_EOTECP0C      HSP_EVT_ICR_EOTECP0C_Msk             /*!< EOTECP0C (Clear EOTECP0F flag) */
/*!< EOTECP1C configuration */
#define HSP_EVT_ICR_EOTECP1C_Pos  (21U)
#define HSP_EVT_ICR_EOTECP1C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP1C_Pos)  /*!< 0x00200000 */
#define HSP_EVT_ICR_EOTECP1C      HSP_EVT_ICR_EOTECP1C_Msk             /*!< EOTECP1C (Clear EOTECP1F flag) */
/*!< EOTECP2C configuration */
#define HSP_EVT_ICR_EOTECP2C_Pos  (22U)
#define HSP_EVT_ICR_EOTECP2C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP2C_Pos)  /*!< 0x00400000 */
#define HSP_EVT_ICR_EOTECP2C      HSP_EVT_ICR_EOTECP2C_Msk             /*!< EOTECP2C (Clear EOTECP2F flag) */
/*!< EOTECP3C configuration */
#define HSP_EVT_ICR_EOTECP3C_Pos  (23U)
#define HSP_EVT_ICR_EOTECP3C_Msk  (0x1UL << HSP_EVT_ICR_EOTECP3C_Pos)  /*!< 0x00800000 */
#define HSP_EVT_ICR_EOTECP3C      HSP_EVT_ICR_EOTECP3C_Msk             /*!< EOTECP3C (Clear EOTECP3F flag) */
/*!< TOVLPC configuration */
#define HSP_EVT_ICR_TOVLPC_Pos    (28U)
#define HSP_EVT_ICR_TOVLPC_Msk    (0x1UL << HSP_EVT_ICR_TOVLPC_Pos)    /*!< 0x10000000 */
#define HSP_EVT_ICR_TOVLPC        HSP_EVT_ICR_TOVLPC_Msk               /*!< TOVLPC (Clear TOVLPF flag) */
/*!< FPUSATC configuration */
#define HSP_EVT_ICR_FPUSATC_Pos   (31U)
#define HSP_EVT_ICR_FPUSATC_Msk   (0x1UL << HSP_EVT_ICR_FPUSATC_Pos)   /*!< 0x80000000 */
#define HSP_EVT_ICR_FPUSATC       HSP_EVT_ICR_FPUSATC_Msk              /*!< FPUSATC (Clear FPUSATF flag) */

/********************  Bit definition for HSP_PFCTEVT_ICR register  ********************/
/*!< PFCTC configuration */
#define HSP_PFCTEVT_ICR_PFCTC_Pos (0U)
#define HSP_PFCTEVT_ICR_PFCTC_Msk (0xFFFFFFFFUL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0xFFFFFFFF */
#define HSP_PFCTEVT_ICR_PFCTC     HSP_PFCTEVT_ICR_PFCTC_Msk                   /*!< PFCTC[31:0] bits (Clear PFCTF[31:0] flag) */
#define HSP_PFCTEVT_ICR_PFCTC_0   (0x00001UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000001 */
#define HSP_PFCTEVT_ICR_PFCTC_1   (0x00002UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000002 */
#define HSP_PFCTEVT_ICR_PFCTC_2   (0x00004UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000004 */
#define HSP_PFCTEVT_ICR_PFCTC_3   (0x00008UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000008 */
#define HSP_PFCTEVT_ICR_PFCTC_4   (0x00010UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000010 */
#define HSP_PFCTEVT_ICR_PFCTC_5   (0x00020UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000020 */
#define HSP_PFCTEVT_ICR_PFCTC_6   (0x00040UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000040 */
#define HSP_PFCTEVT_ICR_PFCTC_7   (0x00080UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000080 */
#define HSP_PFCTEVT_ICR_PFCTC_8   (0x00100UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000100 */
#define HSP_PFCTEVT_ICR_PFCTC_9   (0x00200UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000200 */
#define HSP_PFCTEVT_ICR_PFCTC_10  (0x00400UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000400 */
#define HSP_PFCTEVT_ICR_PFCTC_11  (0x00800UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00000800 */
#define HSP_PFCTEVT_ICR_PFCTC_12  (0x01000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00001000 */
#define HSP_PFCTEVT_ICR_PFCTC_13  (0x02000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00002000 */
#define HSP_PFCTEVT_ICR_PFCTC_14  (0x04000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00004000 */
#define HSP_PFCTEVT_ICR_PFCTC_15  (0x08000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00008000 */
#define HSP_PFCTEVT_ICR_PFCTC_16  (0x10000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00010000 */
#define HSP_PFCTEVT_ICR_PFCTC_17  (0x20000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00020000 */
#define HSP_PFCTEVT_ICR_PFCTC_18  (0x40000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00040000 */
#define HSP_PFCTEVT_ICR_PFCTC_19  (0x80000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)    /*!< 0x00080000 */
#define HSP_PFCTEVT_ICR_PFCTC_20  (0x100000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00100000 */
#define HSP_PFCTEVT_ICR_PFCTC_21  (0x200000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00200000 */
#define HSP_PFCTEVT_ICR_PFCTC_22  (0x400000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00400000 */
#define HSP_PFCTEVT_ICR_PFCTC_23  (0x800000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)   /*!< 0x00800000 */
#define HSP_PFCTEVT_ICR_PFCTC_24  (0x1000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x01000000 */
#define HSP_PFCTEVT_ICR_PFCTC_25  (0x2000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x02000000 */
#define HSP_PFCTEVT_ICR_PFCTC_26  (0x4000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x04000000 */
#define HSP_PFCTEVT_ICR_PFCTC_27  (0x8000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos)  /*!< 0x08000000 */
#define HSP_PFCTEVT_ICR_PFCTC_28  (0x10000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x10000000 */
#define HSP_PFCTEVT_ICR_PFCTC_29  (0x20000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x20000000 */
#define HSP_PFCTEVT_ICR_PFCTC_30  (0x40000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x40000000 */
#define HSP_PFCTEVT_ICR_PFCTC_31  (0x80000000UL << HSP_PFCTEVT_ICR_PFCTC_Pos) /*!< 0x80000000 */

