stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32U3xx/Include/stm32u3c5xx.h
/********************  Bit definition for HSP_HWCFGR1 register  ********************/
/*!< BRAM_SIZE configuration */
#define HSP_HWCFGR1_BRAM_SIZE_Pos (0U)
#define HSP_HWCFGR1_BRAM_SIZE_Msk (0xFFFFUL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x0000FFFF */
#define HSP_HWCFGR1_BRAM_SIZE     HSP_HWCFGR1_BRAM_SIZE_Msk               /*!< BRAM_SIZE[15:0] bits (BRAM size) */
#define HSP_HWCFGR1_BRAM_SIZE_0   (0x0001UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000001 */
#define HSP_HWCFGR1_BRAM_SIZE_1   (0x0002UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000002 */
#define HSP_HWCFGR1_BRAM_SIZE_2   (0x0004UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000004 */
#define HSP_HWCFGR1_BRAM_SIZE_3   (0x0008UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000008 */
#define HSP_HWCFGR1_BRAM_SIZE_4   (0x0010UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000010 */
#define HSP_HWCFGR1_BRAM_SIZE_5   (0x0020UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000020 */
#define HSP_HWCFGR1_BRAM_SIZE_6   (0x0040UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000040 */
#define HSP_HWCFGR1_BRAM_SIZE_7   (0x0080UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000080 */
#define HSP_HWCFGR1_BRAM_SIZE_8   (0x0100UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000100 */
#define HSP_HWCFGR1_BRAM_SIZE_9   (0x0200UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000200 */
#define HSP_HWCFGR1_BRAM_SIZE_10  (0x0400UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000400 */
#define HSP_HWCFGR1_BRAM_SIZE_11  (0x0800UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00000800 */
#define HSP_HWCFGR1_BRAM_SIZE_12  (0x1000UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00001000 */
#define HSP_HWCFGR1_BRAM_SIZE_13  (0x2000UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00002000 */
#define HSP_HWCFGR1_BRAM_SIZE_14  (0x4000UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00004000 */
#define HSP_HWCFGR1_BRAM_SIZE_15  (0x8000UL << HSP_HWCFGR1_BRAM_SIZE_Pos) /*!< 0x00008000 */
/*!< DRAM_SIZE configuration */
#define HSP_HWCFGR1_DRAM_SIZE_Pos (16U)
#define HSP_HWCFGR1_DRAM_SIZE_Msk (0xFFUL << HSP_HWCFGR1_DRAM_SIZE_Pos)   /*!< 0x00FF0000 */
#define HSP_HWCFGR1_DRAM_SIZE     HSP_HWCFGR1_DRAM_SIZE_Msk               /*!< DRAM_SIZE[7:0] bits (DRAM Size) */
#define HSP_HWCFGR1_DRAM_SIZE_0   (0x001UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00010000 */
#define HSP_HWCFGR1_DRAM_SIZE_1   (0x002UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00020000 */
#define HSP_HWCFGR1_DRAM_SIZE_2   (0x004UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00040000 */
#define HSP_HWCFGR1_DRAM_SIZE_3   (0x008UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00080000 */
#define HSP_HWCFGR1_DRAM_SIZE_4   (0x010UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00100000 */
#define HSP_HWCFGR1_DRAM_SIZE_5   (0x020UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00200000 */
#define HSP_HWCFGR1_DRAM_SIZE_6   (0x040UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00400000 */
#define HSP_HWCFGR1_DRAM_SIZE_7   (0x080UL << HSP_HWCFGR1_DRAM_SIZE_Pos)  /*!< 0x00800000 */
/*!< CRAM_SIZE configuration */
#define HSP_HWCFGR1_CRAM_SIZE_Pos (24U)
#define HSP_HWCFGR1_CRAM_SIZE_Msk (0xFFUL << HSP_HWCFGR1_CRAM_SIZE_Pos)   /*!< 0xFF000000 */
#define HSP_HWCFGR1_CRAM_SIZE     HSP_HWCFGR1_CRAM_SIZE_Msk               /*!< CRAM_SIZE[7:0] bits (CRAM Size) */
#define HSP_HWCFGR1_CRAM_SIZE_0   (0x001UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x01000000 */
#define HSP_HWCFGR1_CRAM_SIZE_1   (0x002UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x02000000 */
#define HSP_HWCFGR1_CRAM_SIZE_2   (0x004UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x04000000 */
#define HSP_HWCFGR1_CRAM_SIZE_3   (0x008UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x08000000 */
#define HSP_HWCFGR1_CRAM_SIZE_4   (0x010UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x10000000 */
#define HSP_HWCFGR1_CRAM_SIZE_5   (0x020UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x20000000 */
#define HSP_HWCFGR1_CRAM_SIZE_6   (0x040UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x40000000 */
#define HSP_HWCFGR1_CRAM_SIZE_7   (0x080UL << HSP_HWCFGR1_CRAM_SIZE_Pos)  /*!< 0x80000000 */

/********************  Bit definition for HSP_VERR register  ********************/
/*!< MINREV configuration */
#define HSP_VERR_MINREV_Pos (0U)
#define HSP_VERR_MINREV_Msk (0xFUL << HSP_VERR_MINREV_Pos)  /*!< 0x0000000F */
#define HSP_VERR_MINREV     HSP_VERR_MINREV_Msk             /*!< MINREV[3:0] bits (Minor revision) */
#define HSP_VERR_MINREV_0   (0x01UL << HSP_VERR_MINREV_Pos) /*!< 0x00000001 */
#define HSP_VERR_MINREV_1   (0x02UL << HSP_VERR_MINREV_Pos) /*!< 0x00000002 */
#define HSP_VERR_MINREV_2   (0x04UL << HSP_VERR_MINREV_Pos) /*!< 0x00000004 */
#define HSP_VERR_MINREV_3   (0x08UL << HSP_VERR_MINREV_Pos) /*!< 0x00000008 */
/*!< MAJREV configuration */
#define HSP_VERR_MAJREV_Pos (4U)
#define HSP_VERR_MAJREV_Msk (0xFUL << HSP_VERR_MAJREV_Pos)  /*!< 0x000000F0 */
#define HSP_VERR_MAJREV     HSP_VERR_MAJREV_Msk             /*!< MAJREV[3:0] bits (Major revision) */
#define HSP_VERR_MAJREV_0   (0x01UL << HSP_VERR_MAJREV_Pos) /*!< 0x00000010 */
#define HSP_VERR_MAJREV_1   (0x02UL << HSP_VERR_MAJREV_Pos) /*!< 0x00000020 */
#define HSP_VERR_MAJREV_2   (0x04UL << HSP_VERR_MAJREV_Pos) /*!< 0x00000040 */
#define HSP_VERR_MAJREV_3   (0x08UL << HSP_VERR_MAJREV_Pos) /*!< 0x00000080 */

/********************  Bit definition for HSP_IPIDR register  ********************/
/*!< ID configuration */
#define HSP_IPIDR_ID_Pos (0U)
#define HSP_IPIDR_ID_Msk (0xFFFFFFFFUL << HSP_IPIDR_ID_Pos) /*!< 0xFFFFFFFF */
#define HSP_IPIDR_ID     HSP_IPIDR_ID_Msk                   /*!< ID[31:0] bits (HSP identifier) */
#define HSP_IPIDR_ID_0   (0x00001UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000001 */
#define HSP_IPIDR_ID_1   (0x00002UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000002 */
#define HSP_IPIDR_ID_2   (0x00004UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000004 */
#define HSP_IPIDR_ID_3   (0x00008UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000008 */
#define HSP_IPIDR_ID_4   (0x00010UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000010 */
#define HSP_IPIDR_ID_5   (0x00020UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000020 */
#define HSP_IPIDR_ID_6   (0x00040UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000040 */
#define HSP_IPIDR_ID_7   (0x00080UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000080 */
#define HSP_IPIDR_ID_8   (0x00100UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000100 */
#define HSP_IPIDR_ID_9   (0x00200UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000200 */
#define HSP_IPIDR_ID_10  (0x00400UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000400 */
#define HSP_IPIDR_ID_11  (0x00800UL << HSP_IPIDR_ID_Pos)    /*!< 0x00000800 */
#define HSP_IPIDR_ID_12  (0x01000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00001000 */
#define HSP_IPIDR_ID_13  (0x02000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00002000 */
#define HSP_IPIDR_ID_14  (0x04000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00004000 */
#define HSP_IPIDR_ID_15  (0x08000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00008000 */
#define HSP_IPIDR_ID_16  (0x10000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00010000 */
#define HSP_IPIDR_ID_17  (0x20000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00020000 */
#define HSP_IPIDR_ID_18  (0x40000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00040000 */
#define HSP_IPIDR_ID_19  (0x80000UL << HSP_IPIDR_ID_Pos)    /*!< 0x00080000 */
#define HSP_IPIDR_ID_20  (0x100000UL << HSP_IPIDR_ID_Pos)   /*!< 0x00100000 */
#define HSP_IPIDR_ID_21  (0x200000UL << HSP_IPIDR_ID_Pos)   /*!< 0x00200000 */
#define HSP_IPIDR_ID_22  (0x400000UL << HSP_IPIDR_ID_Pos)   /*!< 0x00400000 */
#define HSP_IPIDR_ID_23  (0x800000UL << HSP_IPIDR_ID_Pos)   /*!< 0x00800000 */
#define HSP_IPIDR_ID_24  (0x1000000UL << HSP_IPIDR_ID_Pos)  /*!< 0x01000000 */
#define HSP_IPIDR_ID_25  (0x2000000UL << HSP_IPIDR_ID_Pos)  /*!< 0x02000000 */
#define HSP_IPIDR_ID_26  (0x4000000UL << HSP_IPIDR_ID_Pos)  /*!< 0x04000000 */
#define HSP_IPIDR_ID_27  (0x8000000UL << HSP_IPIDR_ID_Pos)  /*!< 0x08000000 */
#define HSP_IPIDR_ID_28  (0x10000000UL << HSP_IPIDR_ID_Pos) /*!< 0x10000000 */
#define HSP_IPIDR_ID_29  (0x20000000UL << HSP_IPIDR_ID_Pos) /*!< 0x20000000 */
#define HSP_IPIDR_ID_30  (0x40000000UL << HSP_IPIDR_ID_Pos) /*!< 0x40000000 */
#define HSP_IPIDR_ID_31  (0x80000000UL << HSP_IPIDR_ID_Pos) /*!< 0x80000000 */

/********************  Bit definition for HSP_SIDR register  ********************/
/*!< SID configuration */
#define HSP_SIDR_SID_Pos (0U)
#define HSP_SIDR_SID_Msk (0xFFFFFFFFUL << HSP_SIDR_SID_Pos) /*!< 0xFFFFFFFF */
#define HSP_SIDR_SID HSP_SIDR_SID_Msk /*!< SID[31:0] bits (Size identification) */
#define HSP_SIDR_SID_0 (0x00001UL << HSP_SIDR_SID_Pos) /*!< 0x00000001 */
#define HSP_SIDR_SID_1 (0x00002UL << HSP_SIDR_SID_Pos) /*!< 0x00000002 */
#define HSP_SIDR_SID_2 (0x00004UL << HSP_SIDR_SID_Pos) /*!< 0x00000004 */
#define HSP_SIDR_SID_3 (0x00008UL << HSP_SIDR_SID_Pos) /*!< 0x00000008 */
#define HSP_SIDR_SID_4 (0x00010UL << HSP_SIDR_SID_Pos) /*!< 0x00000010 */
#define HSP_SIDR_SID_5 (0x00020UL << HSP_SIDR_SID_Pos) /*!< 0x00000020 */
#define HSP_SIDR_SID_6 (0x00040UL << HSP_SIDR_SID_Pos) /*!< 0x00000040 */
#define HSP_SIDR_SID_7 (0x00080UL << HSP_SIDR_SID_Pos) /*!< 0x00000080 */
#define HSP_SIDR_SID_8 (0x00100UL << HSP_SIDR_SID_Pos) /*!< 0x00000100 */
#define HSP_SIDR_SID_9 (0x00200UL << HSP_SIDR_SID_Pos) /*!< 0x00000200 */
#define HSP_SIDR_SID_10 (0x00400UL << HSP_SIDR_SID_Pos) /*!< 0x00000400 */
#define HSP_SIDR_SID_11 (0x00800UL << HSP_SIDR_SID_Pos) /*!< 0x00000800 */
#define HSP_SIDR_SID_12 (0x01000UL << HSP_SIDR_SID_Pos) /*!< 0x00001000 */
#define HSP_SIDR_SID_13 (0x02000UL << HSP_SIDR_SID_Pos) /*!< 0x00002000 */
#define HSP_SIDR_SID_14 (0x04000UL << HSP_SIDR_SID_Pos) /*!< 0x00004000 */
#define HSP_SIDR_SID_15 (0x08000UL << HSP_SIDR_SID_Pos) /*!< 0x00008000 */
#define HSP_SIDR_SID_16 (0x10000UL << HSP_SIDR_SID_Pos) /*!< 0x00010000 */
#define HSP_SIDR_SID_17 (0x20000UL << HSP_SIDR_SID_Pos) /*!< 0x00020000 */
#define HSP_SIDR_SID_18 (0x40000UL << HSP_SIDR_SID_Pos) /*!< 0x00040000 */
#define HSP_SIDR_SID_19 (0x80000UL << HSP_SIDR_SID_Pos) /*!< 0x00080000 */
#define HSP_SIDR_SID_20 (0x100000UL << HSP_SIDR_SID_Pos) /*!< 0x00100000 */
#define HSP_SIDR_SID_21 (0x200000UL << HSP_SIDR_SID_Pos) /*!< 0x00200000 */
#define HSP_SIDR_SID_22 (0x400000UL << HSP_SIDR_SID_Pos) /*!< 0x00400000 */
#define HSP_SIDR_SID_23 (0x800000UL << HSP_SIDR_SID_Pos) /*!< 0x00800000 */
#define HSP_SIDR_SID_24 (0x1000000UL << HSP_SIDR_SID_Pos) /*!< 0x01000000 */
#define HSP_SIDR_SID_25 (0x2000000UL << HSP_SIDR_SID_Pos) /*!< 0x02000000 */
#define HSP_SIDR_SID_26 (0x4000000UL << HSP_SIDR_SID_Pos) /*!< 0x04000000 */
#define HSP_SIDR_SID_27 (0x8000000UL << HSP_SIDR_SID_Pos) /*!< 0x08000000 */
#define HSP_SIDR_SID_28 (0x10000000UL << HSP_SIDR_SID_Pos) /*!< 0x10000000 */
#define HSP_SIDR_SID_29 (0x20000000UL << HSP_SIDR_SID_Pos) /*!< 0x20000000 */
#define HSP_SIDR_SID_30 (0x40000000UL << HSP_SIDR_SID_Pos) /*!< 0x40000000 */
#define HSP_SIDR_SID_31 (0x80000000UL << HSP_SIDR_SID_Pos) /*!< 0x80000000 */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos                      (0U)
#define I2C_CR1_PE_Msk                      (0x1UL << I2C_CR1_PE_Pos)               /*!< 0x00000001 */
#define I2C_CR1_PE                          I2C_CR1_PE_Msk                          /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos                    (1U)
#define I2C_CR1_TXIE_Msk                    (0x1UL << I2C_CR1_TXIE_Pos)             /*!< 0x00000002 */
#define I2C_CR1_TXIE                        I2C_CR1_TXIE_Msk                        /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos                    (2U)
#define I2C_CR1_RXIE_Msk                    (0x1UL << I2C_CR1_RXIE_Pos)             /*!< 0x00000004 */
#define I2C_CR1_RXIE                        I2C_CR1_RXIE_Msk                        /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos                  (3U)
#define I2C_CR1_ADDRIE_Msk                  (0x1UL << I2C_CR1_ADDRIE_Pos)           /*!< 0x00000008 */
#define I2C_CR1_ADDRIE                      I2C_CR1_ADDRIE_Msk                      /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_Pos                  (4U)
#define I2C_CR1_NACKIE_Msk                  (0x1UL << I2C_CR1_NACKIE_Pos)           /*!< 0x00000010 */
#define I2C_CR1_NACKIE                      I2C_CR1_NACKIE_Msk                      /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_Pos                  (5U)
#define I2C_CR1_STOPIE_Msk                  (0x1UL << I2C_CR1_STOPIE_Pos)           /*!< 0x00000020 */
#define I2C_CR1_STOPIE                      I2C_CR1_STOPIE_Msk                      /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos                    (6U)
#define I2C_CR1_TCIE_Msk                    (0x1UL << I2C_CR1_TCIE_Pos)             /*!< 0x00000040 */
#define I2C_CR1_TCIE                        I2C_CR1_TCIE_Msk                        /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_Pos                   (7U)
#define I2C_CR1_ERRIE_Msk                   (0x1UL << I2C_CR1_ERRIE_Pos)            /*!< 0x00000080 */
#define I2C_CR1_ERRIE                       I2C_CR1_ERRIE_Msk                       /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos                     (8U)
#define I2C_CR1_DNF_Msk                     (0xFUL << I2C_CR1_DNF_Pos)              /*!< 0x00000F00 */
#define I2C_CR1_DNF                         I2C_CR1_DNF_Msk                         /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos                  (12U)
#define I2C_CR1_ANFOFF_Msk                  (0x1UL << I2C_CR1_ANFOFF_Pos)           /*!< 0x00001000 */
#define I2C_CR1_ANFOFF                      I2C_CR1_ANFOFF_Msk                      /*!< Analog noise filter OFF */
#define I2C_CR1_SWRST_Pos                   (13U)
#define I2C_CR1_SWRST_Msk                   (0x1UL << I2C_CR1_SWRST_Pos)            /*!< 0x00002000 */
#define I2C_CR1_SWRST                       I2C_CR1_SWRST_Msk                       /*!< Software reset */
#define I2C_CR1_TXDMAEN_Pos                 (14U)
#define I2C_CR1_TXDMAEN_Msk                 (0x1UL << I2C_CR1_TXDMAEN_Pos)          /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN                     I2C_CR1_TXDMAEN_Msk                     /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos                 (15U)
#define I2C_CR1_RXDMAEN_Msk                 (0x1UL << I2C_CR1_RXDMAEN_Pos)          /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN                     I2C_CR1_RXDMAEN_Msk                     /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos                     (16U)
#define I2C_CR1_SBC_Msk                     (0x1UL << I2C_CR1_SBC_Pos)              /*!< 0x00010000 */
#define I2C_CR1_SBC                         I2C_CR1_SBC_Msk                         /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos               (17U)
#define I2C_CR1_NOSTRETCH_Msk               (0x1UL << I2C_CR1_NOSTRETCH_Pos)        /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH                   I2C_CR1_NOSTRETCH_Msk                   /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_Pos                   (18U)
#define I2C_CR1_WUPEN_Msk                   (0x1UL << I2C_CR1_WUPEN_Pos)            /*!< 0x00040000 */
#define I2C_CR1_WUPEN                       I2C_CR1_WUPEN_Msk                       /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_Pos                    (19U)
#define I2C_CR1_GCEN_Msk                    (0x1UL << I2C_CR1_GCEN_Pos)             /*!< 0x00080000 */
#define I2C_CR1_GCEN                        I2C_CR1_GCEN_Msk                        /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos                  (20U)
#define I2C_CR1_SMBHEN_Msk                  (0x1UL << I2C_CR1_SMBHEN_Pos)           /*!< 0x00100000 */
#define I2C_CR1_SMBHEN                      I2C_CR1_SMBHEN_Msk                      /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos                  (21U)
#define I2C_CR1_SMBDEN_Msk                  (0x1UL << I2C_CR1_SMBDEN_Pos)           /*!< 0x00200000 */
#define I2C_CR1_SMBDEN                      I2C_CR1_SMBDEN_Msk                      /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos                 (22U)
#define I2C_CR1_ALERTEN_Msk                 (0x1UL << I2C_CR1_ALERTEN_Pos)          /*!< 0x00400000 */
#define I2C_CR1_ALERTEN                     I2C_CR1_ALERTEN_Msk                     /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos                   (23U)
#define I2C_CR1_PECEN_Msk                   (0x1UL << I2C_CR1_PECEN_Pos)            /*!< 0x00800000 */
#define I2C_CR1_PECEN                       I2C_CR1_PECEN_Msk                       /*!< PEC enable */
#define I2C_CR1_FMP_Pos                     (24U)
#define I2C_CR1_FMP_Msk                     (0x1UL << I2C_CR1_FMP_Pos)              /*!< 0x01000000 */
#define I2C_CR1_FMP                         I2C_CR1_FMP_Msk                         /*!< FMP enable */
#define I2C_CR1_ADDRACLR_Pos                (30U)
#define I2C_CR1_ADDRACLR_Msk                (0x1UL << I2C_CR1_ADDRACLR_Pos)         /*!< 0x40000000 */
#define I2C_CR1_ADDRACLR                    I2C_CR1_ADDRACLR_Msk                    /*!< ADDRACLR enable */
#define I2C_CR1_STOPFACLR_Pos               (31U)
#define I2C_CR1_STOPFACLR_Msk               (0x1UL << I2C_CR1_STOPFACLR_Pos)        /*!< 0x80000000 */
#define I2C_CR1_STOPFACLR                   I2C_CR1_STOPFACLR_Msk                   /*!< STOPFACLR enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos                    (0U)
#define I2C_CR2_SADD_Msk                    (0x3FFUL << I2C_CR2_SADD_Pos)           /*!< 0x000003FF */
#define I2C_CR2_SADD                        I2C_CR2_SADD_Msk                        /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos                  (10U)
#define I2C_CR2_RD_WRN_Msk                  (0x1UL << I2C_CR2_RD_WRN_Pos)           /*!< 0x00000400 */
#define I2C_CR2_RD_WRN                      I2C_CR2_RD_WRN_Msk                      /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos                   (11U)
#define I2C_CR2_ADD10_Msk                   (0x1UL << I2C_CR2_ADD10_Pos)            /*!< 0x00000800 */
#define I2C_CR2_ADD10                       I2C_CR2_ADD10_Msk                       /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos                 (12U)
#define I2C_CR2_HEAD10R_Msk                 (0x1UL << I2C_CR2_HEAD10R_Pos)          /*!< 0x00001000 */
#define I2C_CR2_HEAD10R                     I2C_CR2_HEAD10R_Msk                     /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_Pos                   (13U)
#define I2C_CR2_START_Msk                   (0x1UL << I2C_CR2_START_Pos)            /*!< 0x00002000 */
#define I2C_CR2_START                       I2C_CR2_START_Msk                       /*!< START generation */
#define I2C_CR2_STOP_Pos                    (14U)
#define I2C_CR2_STOP_Msk                    (0x1UL << I2C_CR2_STOP_Pos)             /*!< 0x00004000 */
#define I2C_CR2_STOP                        I2C_CR2_STOP_Msk                        /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos                    (15U)
#define I2C_CR2_NACK_Msk                    (0x1UL << I2C_CR2_NACK_Pos)             /*!< 0x00008000 */
#define I2C_CR2_NACK                        I2C_CR2_NACK_Msk                        /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos                  (16U)
#define I2C_CR2_NBYTES_Msk                  (0xFFUL << I2C_CR2_NBYTES_Pos)          /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES                      I2C_CR2_NBYTES_Msk                      /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos                  (24U)
#define I2C_CR2_RELOAD_Msk                  (0x1UL << I2C_CR2_RELOAD_Pos)           /*!< 0x01000000 */
#define I2C_CR2_RELOAD                      I2C_CR2_RELOAD_Msk                      /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos                 (25U)
#define I2C_CR2_AUTOEND_Msk                 (0x1UL << I2C_CR2_AUTOEND_Pos)          /*!< 0x02000000 */
#define I2C_CR2_AUTOEND                     I2C_CR2_AUTOEND_Msk                     /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos                 (26U)
#define I2C_CR2_PECBYTE_Msk                 (0x1UL << I2C_CR2_PECBYTE_Pos)          /*!< 0x04000000 */
#define I2C_CR2_PECBYTE                     I2C_CR2_PECBYTE_Msk                     /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos                    (0U)
#define I2C_OAR1_OA1_Msk                    (0x3FFUL << I2C_OAR1_OA1_Pos)           /*!< 0x000003FF */
#define I2C_OAR1_OA1                        I2C_OAR1_OA1_Msk                        /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos                (10U)
#define I2C_OAR1_OA1MODE_Msk                (0x1UL << I2C_OAR1_OA1MODE_Pos)         /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE                    I2C_OAR1_OA1MODE_Msk                    /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_Pos                  (15U)
#define I2C_OAR1_OA1EN_Msk                  (0x1UL << I2C_OAR1_OA1EN_Pos)           /*!< 0x00008000 */
#define I2C_OAR1_OA1EN                      I2C_OAR1_OA1EN_Msk                      /*!< Own address 1 enable */

